/*-----------------------------------------------------------------------------------------------------------*/
/* These are the keys for the commands: Arrow, Reject, Unmark, Favorite, Keyword, Voiceover, Crop, Adjust, Edit, Audio, Inspector */
toolCommands				= "\rRUFKOCVEAI";
toolCommands2				= "\rRUFKOCVEAI";

/*-----------------------------------------------------------------------------------------------------------*/
/* These are the URLs launched from the menus	*/

urlProvideFeedback			= "http://www.apple.com/fi/feedback/imovie.html";
urlRegister					= "https://www.apple.com/fi/ilife/register/";

SupportURL					= "http://www.apple.com/fi/support/imovie";

whatsNewURL				= "http://www.apple.com/fi/welcomescreen/ilife/imovie-9/";

/*-----------------------------------------------------------------------------------------------------------*/
eventFolderName				= "iMovie-tapahtumat";
dropBoxFolderName			= "iMovie-pudotuslaatikko";
dropBoxRejectedName			= "Käyttämättömät pudotuslaatikkokohteet";
projectFolderName			= "iMovie-projektit";
shareFolderName				= "iMovie-jako";
speedConvertedFolderName		= "Alkuperäiset iMovie-elokuvat";
archivesFolderName			= "iMovien kamera-arkistot";

/*-----------------------------------------------------------------------------------------------------------*/
/* These two strings must match the prefix that iMovieHD uses in each language for naming files */

iMovieHDMoviePrefix			= "Leike";
iMovieHDStillPrefix				= "Still-kuva";

/*-----------------------------------------------------------------------------------------------------------*/
/* These are the main localizable strings */
yes						= "Kyllä";
no						= "Ei";
cancel					= "Kumoa";
ok						= "OK";
continue					= "Jatka";
skip						= "Ohita";

/* this string displays in the about box. The argument is the version number and build number */
/* AppName VersionFormat */
aboutFormat				= "versio %@";

iPhotoLibraryName			= "iPhoto-videot";
apertureLibraryName			= "Aperture-videot";

firstProjectName				= "Ensimmäinen projektini";
untitledProject				= "Uusi projekti";
untitledFolder				= "Uusi kansio";
untitledTrailer				= "Uusi elokuvatraileri";

musicLibraryName				= "Musiikki";

captureStatusFontName			= "Helvetica Neue Condensed Black";
captureStatusFontSize			= "36";


/* validTimecodeCharacters: Any literal characters that appear in 'tensFormat', 'secondsTenthsFormat', 'secondsFormat', or
 any other timecode formatter need to be in this string. 
 So if secondsTenthsFormat is '%d Sek", the value would be '.,:;0123456789s Sek'
 */
validTimecodeCharacters		= ".,:;0123456789 s";

/* timecodeSeparator, and alternateTimecodeSeparator<N> keys: Must be a single ROMAN character. 
   time/speed entry fields in iMovie do not allow non-roman entry methods. */
timecodeSeparator			= ":";
alternateTimecodeSeparator1		= ",";
alternateTimecodeSeparator2		= ".";
alternateTimecodeSeparator3		= ";";
durationFormat				= "0,0";

/* if you add spaces or other literal characters to these formats, they must also appear in the 'validTimecodeCharacters' key. */
durationFormatOneDecimal		= "0.# s";
durationFormat100			= "0,0 s";
durationFormatS				= "0,0 s";

/* validSpeedCharacters: the separator must be first. non-roman characters are prohibited. */
validSpeedCharacters			= "0123456789";
speedFormat				= "0,# ";

minScreenResolution-title = "Tuettua näyttöä ei löytynyt";
minScreenResolution-msg = "iMovie vaatii ainakin yhden näytön, jonka vähimmäistarkkuus on 1024 x 768. Voit säätää tarkkuutta Järjestelmäasetuksissa.";

quit						= "Lopeta";
update					= "Päivitä";
updateProjectTitle				= "Projektimuodon päivitys";
updateProjectMessage			= "Projektien sisäinen muoto on päivitettävä. Kun projektit on päivitetty, et voi enää käyttää niitä iMovien aiempien versioiden kanssa.";

updatingThumbnails			= "Päivitetään projektin miniatyyrejä...";
updatingThumbnailsFormat		= "Projekti: %@";
thumbnailSaveError			= "Projektin ”%@” miniatyyrejä ei voida päivittää. Levy saattaa olla täynnä.";
thumbnailOneError			= "Miniatyyria ei voida luoda";
thumbnailManyError			= "Miniatyyreja ei voida luoda";
thumbnailCountManyError		= "%d leikettä ei voitu luoda";

tapeDateRangeFormat			= "%1$@ - %2$@";
tapeDateCalendarListRangeFormat	= "%1$@ - %2$@";
createdOn					= "Luotu: %@";

splitEventsFormat				= "%1$@ - %2$d. päivä";

tapeOfflineTitle				= "Tapahtumaa ei löytynyt";
tapeOfflineMessage			= "Leikkeen tapahtuma ei ole enää käytettävissä.";
tapeOfflineFormat				= "Leikkeen tapahtumaa ei löytynyt.\r\rLevy ”%@” ei ole enää käytettävissä. Liitä levy uudelleen, jotta leikkeen lähdevideota voidaan käyttää.";

saveThumbnail16x9Message		= "Tallenna miniatyyriasetukset (16:9) nimellä:";
saveThumbnail4x3Message		= "Tallenna miniatyyriasetukset (4:3) nimellä:";

thumbnailTitle				= "Luodaan miniatyyrikuvia";
thumbnailEventFormat			= "Käsitellään tapahtumaa: %@";
cancelingThumbs				= "Kumotaan...";

needToBeOptimized			= "Tämä leike on optimoitava ennen kuin sen nopeutta voidaan säätää.";
movieCacheProgressTitle		= "Optimoidaan elokuvia";
movieCacheProgressMessage		= "Käsitellään tapahtumaa: %@";
/* updateAllVerboselyMessage appears when holding down the command key on app launch and/or other rescanning actions. */
/* argument 1: event folder path name. argument 2: number of items in that folder that will be examined */
updateAllVerboselyMessage		= "%1$@: %2$d kohdetta";

stabilizingClipProgressTitle		= "Analysoidaan vakautusta varten";
/* Used when analyzing a chunk of a clip */
stabilizingSavingDataTitle			= "Tallennetaan vakautusdataa"; 
/* Used when analyzing multiple clips */
stabilizingSaveProgressText			= "Tallennetaan dataa: %d %% suoritettu";

/* this message is displayed in the gridview if the user selects the iPhoto or Aperture event before we've finished parsing iLifeMediaBrowser results. */
loadingiPhotoApertureMsg		= "Elokuvia ladataan. Tällä hetkellä %d%% valmis.";

createThumbsNow				= "Nyt";
createThumbsLater			= "Myöhemmin";
missingiPhotoThumbsTitle		= "iPhoto-videominiatyyrit";
missingiPhotoThumbsMessage		= "iMovien on luotava miniatyyrit iPhoto-kirjaston videoista. Tämä saattaa kestää useita minuutteja.\r\rVoit siirtää toiminnon myöhemmäksi osoittamalla Myöhemmin, mutta iPhoto-videot eivät ole käytettävissä ennen kuin avaat iMovien uudelleen.";

missingApertureThumbsTitle		= "Aperture-videominiatyyrit";
missingApertureThumbsMessage		= "iMovien on luotava miniatyyrit Aperture-kirjaston videoista. Tämä saattaa kestää useita minuutteja.\r\rVoit siirtää toiminnon myöhemmäksi osoittamalla Myöhemmin, mutta Aperture-videot eivät ole käytettävissä ennen kuin avaat iMovien uudelleen.";


exportFCPXML				= "Vie FCP XML";
xmlFileName				= "XML-tiedosto";
xmlSequenceName			= "%@ - iMovie";

exportTrailerPlist				= "Vie plist";
plistFileName				= "plist-tiedosto";

exportMovieLabel				= "Vie nimellä:";
exportMovieButton				= "Vie";
exportMovieProgressTitle		= "Vie elokuva";
exportMovieProgressMessage		= "Viedään elokuvaa...";
exportCancelAlertTitle			= "Kumotaanko toiminto %@?";
ellipisString					= "…";

toolMessageAdjust				= "Valitse säädettävä leike";
toolMessageCrop				= "Valitse rajattava\nleike.";
toolMessageVoiceOver			= "Aloita tallentaminen osoittamalla leikettä, josta haluat selostuksen alkavan.";
toolMessageInspector			= "Valitse leike";

/* These three letters are shown on the render indicators in the project list */
/* They can ONLY be A-Z or 0-9 or space */
renderSizeLetters				= "PKS";

selectedFormat				= "%1$@ valittu - %2$@ yhteensä";
multiSelectFormat				= "%1$d / %2$@ valittu - %3$@ yhteensä";
markedFormat				= "%1$@ merkitty - %2$@ yhteensä";
totalFormat					= "%@ yhteensä";
zeroDurationProject			= "0 s";
offsetFromStart				= "%1$@ leikkeen alusta - %2$@";
offsetFromEnd				= "%1$@ leikkeen lopusta - %2$@";

addingStillsTitle				= "Lisää still-kuvia";
addingStillsMessage			= "Lisätään %d still-kuvaa projektiin...";

dimensionsFormat				= "%1$d x %2$d";

projectDurationFPS			= "Kesto: %1$@ - %2$d fps";
projectEmptyFPS				= "Tyhjä - %d fps";
projectModified				= "Muokattu viimeksi: %@";

mobileRenderFormatString		= "3GP, %1$d fps, 80 kb/s, %2$@";
smallRenderFormatString		= "H.264, %1$d fps, 1 Mb/s, %2$@";
mediumRenderFormatString		= "H.264, %1$d fps, 1,7 Mb/s, %2$@";
largeRenderFormatString		= "H.264, %1$d fps, 4 Mb/s, %2$@";
HD720RenderFormatString		= "H.264, %1$d fps, 10 Mb/s, %2$@";
HD1080RenderFormatString		= "H.264, %1$d fps, 20 Mb/s, %2$@";

aproxSizeString				= "n. %@";

instantReplay				= "VÄLITÖN TOISTO";

emptyProjectString			= "Aloita uusi projekti valitsemalla ensin video tai \nkuvat ja vetämällä ne sitten tälle alueelle.";
emptyMediaString				= "Katso video valitsemalla yksi tai useampi tapahtuma tapahtumakirjastosta vasemmalta.\r\rLisää video tapahtumakirjastoosi liittämällä videokamera tai valitsemalla tuontivaihtoehto näytön yläosan Arkisto-valikosta.";
noMediaMatchingCriteria			= "Nykyistä valintaa vastaavia videoleikkeitä ei löydy.\r\rValitse toinen vaihtoehto alla olevasta Näytä-ponnahdusvalikosta.";
noMediaMatchingKeywords		= "Nykyistä valintaa vastaavia videoleikkeitä ei löydy.\r\rValitse toinen vaihtoehto alla olevasta Näytä-ponnahdusvalikosta tai muuta valittuja avainsanoja.";
noTapesString				= "Lisää video tapahtumakirjastoosi liittämällä videokamera\rtai valitsemalla tuontivaihtoehto näytön yläosan Arkisto-valikosta.";

mediaNotFoundString			= "Mediaa ei löytynyt";
deleteEvent					= "Siirrä tapahtuma roskakoriin";
deleteMovie					= "Siirrä leike roskakoriin";
deleteRejected				= "Siirrä hylätyt leikkeet roskakoriin";
appName					= "iMovie";
thumbnailCacheName			= "Miniatyyrit";
mapCacheName				= "Kartat";
tempFolderName				= "Väliaikaiset kohteet";
deleteEventWarning			= "Olet poistamassa olemassa olevien projektien käyttämää videota.\rJos poistat videon, et voi toistaa sitä näissä projekteissa.";
mergeEvents				= "Yhdistä tapahtumat";
deleteSelection				= "Poista valinta";
rejectSelection				= "Hylkää valinta";
rejectEntireClip				= "Hylkää koko leike";
deleteEntireClip				= "Poista koko leike";
selectAll					= "Valitse kaikki";
selectAllEvents				= "Valitse kaikki tapahtumat";
selectEntireClip				= "Valitse koko leike";
moving					= "Siirretään tiedostoja kohteeseen ";
merging					= "Yhdistetään tapahtumia";
undoMerging				= "Peru tapahtumien yhdistäminen";
redoMerging					= "Yhdistä tapahtumat sittenkin";
copying					= "Kopioidaan tiedostoja kohteeseen ";
copyingFiles					= "Kopioidaan tiedostoja";
movingFiles					= "Siirretään tiedostoja";
fileCountDown				= "Käsitellään %1$d / %2$d";
convertingFiles				= "Optimoidaan videota";
moveEvent					= "Siirrä tapahtuma";
copyEvent					= "Kopioi tapahtuma";
viewRejectedClips				= "Katsele hylättyjä leikkeitä";
moveFileToTrash				= "Siirrä tiedosto roskakoriin";
moveToTrash				= "Siirrä roskakoriin";
aboutToDeleteRejected			= "Olet siirtämässä valitun tapahtuman kaikki hylätyt leikkeet roskakoriin.";
aboutToDeleteRejectedMultiple		= "Olet siirtämässä valittujen tapahtumien kaikki hylätyt leikkeet roskakoriin.";
splitEvent					= "Jaa tapahtuma";
copyFailed					= "Tapahtumaa ei voida kopioida";
deleteRejectedFailed			= "Hylättyjä leikkeitä ei voida poistaa";
moveFailed					= "Tapahtumaa ei voida siirtää";
operationIncomplete			= "Toimintoa ei voitu suorittaa loppuun.";
operationIncompleteDisk			= "Toimintoa ei voitu suorittaa, koska kohdelevyllä ei ole riittävästi tilaa.";
deleteIncompleteDisk			= "Toimintoa ei voitu suorittaa, koska vapaata levytilaa ei ole riittävästi.\r\rVapauta levytilaa ja yritä uudelleen.";
cannotPerformOperation			= "Toimintoa ei voida suorittaa tälle kohteelle.";
cannotPerformOperationOnItems	= "Toimintoa ei voida suorittaa näille kohteille.";
renameEvent				= "Nimeä tapahtuma uudelleen";
processingFiles				= "Käsitellään tiedostoja...";
writeFileError				= "Virhe kirjoitettaessa tiedostoa:  ";
redoMoveClip				= "Siirrä leike sittenkin";
undoMoveClipProgressString		= "Peru leikkeen siirto";
moveClip					= "Siirrä leikettä";
moveClipToNewEventTitle		= "Siirrä leike tapahtumaan";
moveClipToNewEventMessage		= "Olet siirtämässä koko leikettä tapahtumaan.";
copyFailedMsg				= "Tätä tiedostoa ei voitu kopioida:\n\n%1$@\n\n(%2$@)";
moveFailedMsg				= "Tätä tiedostoa ei voitu siirtää:\n\n%1$@\n\n(%2$@)";
copyFailedTitle				= "Kopiointi epäonnistui";
moveFailedTitle				= "Siirtäminen epäonnistui";

copyClip					= "Kopioi leike";
copyClipToNewEventTitle			= "Kopioi leike tapahtumaan";
copyClipToNewEventMessage		= "Olet kopioimassa koko leikettä tapahtumaan.";
redoCopyClip				= "Kopioi leike sittenkin";
undoCopyClipProgressString		= "Peru leikkeen kopiointi";

copyClips					= "Kopioi leikkeet";
copyClipsToEventTitle			= "Kopioi leikkeitä tapahtumaan";
copyClipsToEventMessage		= "Olet kopioimassa leikkeitä kokonaisuudessaan tapahtumaan.";
redoCopyClips				= "Kopioi leikkeet sittenkin";
undoCopyClipsProgressString		= "Peru leikkeiden kopiointi";

moveClips					= "Siirrä leikkeet";
moveClipsToEventTitle			= "Siirrä leikkeitä tapahtumaan";
moveClipsToEventMessage		= "Olet siirtämässä leikkeitä kokonaisuudessaan tapahtumaan.";
redoMoveClips				= "Siirrä leikkeet sittenkin";
undoMoveClipsProgressString		= "Peru leikkeiden siirto";

incompatibleFileTitle			= "Tuo tiedosto";
incompatibleFilesTitle			= "Tuo tiedostoja";

importFailedOneFile			= "Tiedostoa ei tuoda.\n\n";
importFailedMultipleFilesOne		= "Yhtä tiedostoa ei tuoda.\n\n";
importFailedMultipleFiles			= "%d tiedostoa ei tuoda.\n\n";
importFailedMultipleFilesAll		= "Tiedostoja ei tuoda.\n\n";
photosNotForEvents			= "Kuvia ei voida tuoda Tapahtumakirjastoon.\n";
soundNotForEvents			= "Äänitiedostoja ei voida tuoda Tapahtumakirjastoon.\n";
soundAndPhotosNotForEvents		= "Kuvia ja äänitiedostoja ei voida tuoda Tapahtumakirjastoon.  ";
tryDraggingToProject			= "Yritä vetämistä suoraan projektiin.";
incompatOneFile				= "Se ei ole yhteensopiva iMovien kanssa.";
incompatOneFileOther			= "Toinen tiedosto ei ole yhteensopiva iMovien kanssa.";
incompatMultipleFiles			= "Muut tiedostot eivät ole yhteensopivia iMovien kanssa.";
incompatMultipleFilesAll			= "Ne eivät ole yhteensopivia iMovien kanssa.";

deleteUnusedImpossible			= "Mitään ei poistettu. Kaikki löydetty video on vähintään yhden projektin käytössä.";
deleteUnusedFailed			= "Käyttämättömiä leikkeitä ei voida poistaa";
deleteUnused				= "Poista käyttämättömät";
deleteUnusedEventWarning1		= "Olet poistamassa videota, joka on käytössä projekteissa. Poistamisen jälkeen videota ei voida enää toistaa näissä projekteissa.\n\nPoista videomateriaali, joka ei ole käytössä missään projektissa, valitsemalla Poista käyttämättömät. Tämä saattaa kestää jonkin aikaa.\n";
deleteUnusedDeleteEvents		= "Siirrä tapahtumat roskakoriin";
deleteUnusedDeleteEvent		= "Siirrä tapahtuma roskakoriin";

setDuration					= "Aseta kesto...";
trimDuration					= "Leiketrimmeri";
trimMusic					= "Leiketrimmeri";

trimToSelection				= "Trimmaa valintaan";
trimAtPlayhead				= "Trimmaa toistopaikkaan";
		
mediaVoiceOverTitle			= "Selostus";
mediaVoiceOverMessage			= "Selostuksia voidaan äänittää vain projektin leikkeisiin.";

projectRatingToolTitle			= "Arvostelutyökalu";
projectRatingToolMessage		= "Vain tapahtumakirjastossa olevaa videota voidaan merkitä suosikiksi tai hylätyksi.";

unrenderTitle				= "Jaettu tai viimeistelty projekti";
unrenderMessage				= "Olet muokannut projektia.\r\Projekti on jaettava tai viimeisteltävä uudelleen, kun olet saanut sen editoitua.";

removedTransitionsTitle			= "Poistetut siirrokset";
removedTransitionsMessage		= "Yksi tai useampi siirros poistettiin, koska mediaa ei ole tarpeeksi.";
cannotAddTransitionTitle			= "Siirrosta ei voida lisätä";
cannotAddTransitionMessage		= "Ei tarpeeksi mediaa päällekkäisyyden lisäämiseksi.\nYritä valitsemalla Päällekkäisyys siirroksissa -valikossa Kokonaan.";
cannotChangeOverlapTitle		= "Päällekkäisyyttä ei voida muuttaa";
cannotChangeOverlapMessage		= "Siirroksen päällekkäisyyttä ei voitu muuttaa, koska mediaa ei ole tarpeeksi.";
cannotChangeTransitionTitle		= "Siirrosta ei voida muuttaa";
cannotChangeTransitionMessage	= "Siirrosta ei voitu muuttaa, koska mediaa ei ole tarpeeksi.";

iDVDAskToSave				= "Tallennetaanko nykyinen iDVD-projekti ennen sulkemista?";
iDVDIsBusy					= "iDVD on varattu. Yritä myöhemmin uudelleen.";
iDVDMenuName				= "iMovie";

defaultBeginningChapterMarkerName =  "Alku";


bulkDragWarningTitle			= "Editointivinkki";
bulkDragWarningMessage		= "Saatat saavuttaa paremman lopputuloksen lisäämällä videon parhaita pätkiä yksittäin.";

undoMoveClipsToTrash			= "Siirrä leikkeet roskakoriin";
undoMoveClipToTrash			= "Siirrä leike roskakoriin";

undo						= "Peru";
delete						= "Poista";
replace						= "Korvaa";
unpublishAndDelete			= "Lopeta julkaisu ja poista";
deletePublishedProjectTitle		= "Julkaistu projekti";

projectNameMobileFormat		= "%@ - Pieni";
projectNameSmallFormat		= "%@ - Mobiili";
projectNameMediumFormat		= "%@ - Keskikokoinen";
projectNameLargeFormat		= "%@ - Suuri";
projectNameHD720Format		= "%@ - 720p";
projectNameHD1080Format		= "%@ - 1080p";

allMoviesAnalyzed				= "Kaikki valitut elokuvat on jo analysoitu.";
noMoviesToConvert			= "Yhtään valituista elokuvista ei voitu optimoida.";

adjustMenuTrimClip			= "Leiketrimmeri";
adjustMenuTrimEdit			= "Tarkkuuseditori";
adjustMenuTransition			= "Siirroksen säädöt";
adjustMenuClip				= "Leikesäädöt";
adjustMenuVideo				= "Videosäädöt";
adjustMenuAudio				= "Äänisäädöt";
adjustMenuCrop				= "Rajaus ja pyöritys";
adjustMenuCropStill			= "Rajaus, Ken Burns -tehoste ja pyöritys";

// viewerMenuLargeXxx: the "Window > Viewer > Large" menu item changes when the window is 1300x950px or larger & external viewer is off.
viewerMenuLargeNormal	= "Suuri"; // this should match the menu name in MainMenu.nib
viewerMenuLargeExact = "Suuri (%dp)"; // the argument is either 540, 720, or 1080
// the medium item can also update if the large size is 720p or 1080p.
viewerMenuMediumNormal = "Normaali"; // this should match the menu name in MainMenu.nib
viewerMenuMediumExact = "Normaali (%dp)"; // the argument is either 540 or 720

year						= "vuosi";
years						= "vuotta";
month					= "kuukausi";
months					= "kuukautta";
day						= "päivä";
days						= "päivää";
hour						= "tunti";
hours						= "tuntia";
minute					= "minuutti";
minutes					= "minuuttia";
second					= "sekunti";
seconds					= "sekuntia";
frame						= "kehys";
frames					= "kehykset";
changeDateMessageOneClip		= "Säädä leikkeen päivämäärää ja aikaa";
changeDateMessageMutlipleClips	= "Säädä leikkeen päivämäärää ja aikaa";
adjustDateTimeUndo			= "Säädä päivämäärää ja aikaa";
adjustMultipleClipsMessage		= "%d valittua leikettä säädetään:";

deleteFolder					= "Siirrä kansio roskakoriin";
deleteProject				= "Siirrä projekti roskakoriin";
undoDuplicateProject			= "Monista projekti";
deleteNone					= "Siirrä roskakoriin";

undoAddClip					= "Lisää elokuvaleike";
undoTrimClip				= "Trimmaa elokuvaleike";
undoExpandClip				= "Laajenna elokuvaleike";
undoDeleteSelection			= "Poista valinta";
undoMoveClip				= "Siirrä leikettä";
undoEdit					= "Muokkaa";
undoAddSong				= "Lisää musiikkia";
undoAddSongs				= "Lisää musiikkia";

undoRejectRange				= "Hylkää alue";
undoSelectRange				= "Merkitse alue suosikiksi";
undoUnMarkRange				= "Poista alueen merkintä";
undoApplyKeyword			= "Lisää avainsana";
undoApplyKeywords			= "Lisää avainsanoja";
undoRemoveKeyword			= "Poista avainsana";
undoRemoveKeywords			= "Poista avainsanat";

undoNewEvent				= "Uusi tapahtuma";
undoNewProject				= "Uusi projekti";
undoNewFolder				= "Uusi kansio";
undoDeleteProject				= "Poista projekti";
undoDeleteFolder				= "Poista kansio";
undoRename				= "Nimeä uudelleen";
undoParameterFormat			= "Muuta %@";
undoRemoveEffects			= "Poista videomuutokset";
undoRemoveAudioAdjustments		= "Poista äänimuutokset";
undoAddVoiceOver			= "Selostus";
undoRemoveMusic				= "Poista musiikki";
undoRemoveVoiceOver			= "Poista selostus";
undoMoveAnchor				= "Siirrä ankkuria";
undoSetAnchor				= "Aseta ankkuri";
undoRemoveAnchor			= "Poista musiikin kiinnitys";
undoVolumeChange			= "Muuta äänenvoimakkuuden tasoa";
undoFadeChange				= "Muuta häivytyksen kestoa";
undoAdjustmentChange			= "Muuta säädön kestoa";
undoRemoveVolumeAdjustment	= "Poista äänenvoimakkuuden säätö";
undoRemoveVolumeAdjustments	= "Poista äänenvoimakkuuden säädöt";
undoSetVolumeToZero			= "Aseta äänenvoimakkuus nollaan";
undoAddTransition				= "Lisää siirros";
undoAddExtra				= "Lisää ekstra";
undoReplaceExtra				= "Korvaa tausta";
undoReplaceEditItem			= "Korvaa leike";
undoAddTitle				= "Lisää otsikko";
undoReplaceTitle				= "Korvaa otsikko";
undoRemoveTitle				= "Poista otsikko";
undoChangeTitle				= "Muuta otsikko";
undoChangeUnderlineColor		= "Muuta alleviivauksen väriä";
undoOutline					= "Reunus";
undoSetAlignment				= "Aseta tasaus";
undoSetOutline				= "Aseta reunus";
undoSetSpacing				= "Aseta riviväli";
undoAutoAdjust				= "Automaattinen säätö";
undoPaste					= "Sijoita";
undoProjectProperties			= "Projektin ominaisuudet";
undoChangeMasterVolume		= "Muuta master-äänenvoimakkuutta";
undoJoinClip					= "Yhdistä leike";
undoSplit					= "Jaa leike";
undoAddStill					= "Lisää kuva";
undoAddStills				= "Lisää kuvia";
undoMoveMusic				= "Siirrä musiikki";
undoSpeedChange				= "Muuta nopeutta";

undoAddKeyword				= "Lisää avainsana";
undoDeleteKeyword			= "Poista avainsana";

undoResizeTitle				= "Muuta otsikon kokoa";
undoMoveTitle				= "Siirrä otsikko";
undoResizeVoiceOver			= "Muuta selostuksen kokoa";
undoMoveVoiceOver			= "Siirrä selostusta";
undoMoveMarker				= "Siirrä merkkiä";
undoRemoveMarker			= "Poista merkki";
undoAddMarker				= "Lisää merkki";
undoAddBeatMarker			= "Lisää iskumerkki";
undoAddBeatMarkers			= "Lisää iskumerkkejä";
undoRemoveBeatMarker			= "Poista iskumerkki";
undoRemoveAllBeatMarkers		= "Poista kaikki iskumerkit";

undoNormalize				= "Normalisoi leikkeen äänenvoimakkuus";
undoUnNormalize				= "Poista normalisointi";

undoPasteAdjustments			= "Sijoita muutokset";
undoAdjustDuration			= "Rajaa";
undoAdjustSetDuration			= "Aseta kesto";
undoSwapKenBurns			= "Vaihda alku ja loppu";
undoAdjustAudioOffset			= "Trimmaa ääni";

undoFreezeDry				= "Valmistele julkaisua varten";
undoLockProject				= "Lukitse projekti";
undoUnlockProject				= "Poista projektin lukitus";

undoMoveProject				= "Siirrä projekti";
undoMoveProjectMedia			= "Siirrä projektin media";
undoConsolidate				= "Yhdistä";

undoRemoveZoneAnchor		= "Vaihda ankkuria";
undoChangeDescription			= "Muuta kuvausta";

undoMuteClip				= "Mykistä leike";
undoUnmuteClip				= "Poista leikkeen mykistys";

undoDisableAutomaticTransitions	= "Poista automaattiset siirrokset käytöstä";
undoSetAutomaticTransition		= "Aseta automaattinen siirros";

undoTransitionDurationMode		= "Siirroksen kestoasetus";
undoStillDurationMode			= "Still-kuvan kestoasetus";

undoExtendOver				= "Laajenna seuraavan leikkeen yli";

undoConvertToProject			= "Muunna projektiksi";

undoSetTransitionOverlap		= "Muuta siirroksen päällekkäisyyttä";

/* Undos related to maps */
extra.startLocation				= "Lähtöpaikka";
extra.endLocation				= "Määränpää";
extra.supportsEndLocation		= "Määränpää";
extra.hideRouteAndCity			= "Näkyvät reitit ja kaupungit";
extra.showClouds				= "Pilvet";
extra.zoomIn				= "Zoomaus";
undoSwapMapLocations			= "Vaihda karttasijainteja";
mapLocation				= "Sijainti";

noMarkers					= "Ei kommentteja, kappalemerkkejä tai otsikkoja";
markerType0				= "Kommentit";
markerType1				= "Kappalemerkit";
markerType2				= "Iskumerkit";
chapterMarkerPrefix			= "➜ ";
titleHeading					= "Otsikot";

pasteAdjustmentsCutaway		= "Leikkauskuva";
pasteAdjustmentsPIP			= "Kuva kuvassa";
pasteAdjustmentsGreenScreen		= "Vihreä tausta";
pasteAdjustmentsBlueScreen		= "Sininen tausta";
pasteAdjustmentsSideBySide		= "Vierekkäin";

muteClip					= "Mykistä leike";
muteClips					= "Mykistä leikkeet";
unmuteClip					= "Poista leikkeen mykistys";
unmuteClips					= "Poista leikkeiden mykistys";

automaticTransitionWarningTitle	= "Automaattiset siirrokset ovat käytössä";
automaticDynamicTransitionWarningTitle = "Automaattiset siirrokset ja otsikot ovat käytössä";
automaticTransitionWarningMessage	= "Jos haluat tehdä muutoksia yksittäisiin siirroksiin, automaattiset siirrokset on poistettava käytöstä. Kaikki projektissa olevat siirrokset säilyvät projektissa.";
automaticDynamicTransitionWarningMessage = "Jos haluat tehdä muutoksia yksittäisiin siirroksiin tai otsikoihin, automaattiset siirrokset ja otsikot on poistettava käytöstä. Kaikki projektissa olevat siirrokset ja otsikot säilyvät projektissa.";
disable					= "Poista automaattiset siirrokset käytöstä";

missingFilesTitle				= "Puuttuvat tiedostot";
missingFilesMessage1Proj		= "Joitakin projektin ”%@” leikkeitä ei löytynyt.  ";
missingFilesMessageMultiProj		= "Joitakin näiden projektien leikkeitä ei löytynyt.  ";
missingSongsMessage1Proj		= "Joitakin projektin ”%@” musiikkiraitoja ei löytynyt.  ";
missingSongsMessageMultiProj		= "Joitakin näiden projektien musiikkiraitoja ei löytynyt.  ";
notCopied					= "Niitä ei kopioida.";
notMoved					= "Niitä ei siirretä.";

projectMovedToVolume			= "Osa projektissa käytetyistä leikkeistä ei ole kovalevyllä ”%@”. Voit koota kaikki leikkeet yhteen kovalevyllesi jollakin seuraavista tavoista:";
projectsMovedToVolume			= "Osa näissä %1$@ projektissa käytetyistä leikkeistä ei ole kovalevyllä ”%2$@”. Voit koota kaikki leikkeet yhteen kovalevyllesi jollakin seuraavista tavoista:";
showMoreMoveOptions			= "Näytä enemmän valintoja";
showLessMoveOptions			= "Näytä vähemmän valintoja";

changeProjectRateTitle			= "Kehysnopeudet eivät täsmää";
changeProjectRateMessage		= "Leikkeen kehysnopeus on %1$d ja projektin kehysnopeus on %2$d. Haluatko muuttaa projektin kehysnopeudeksi %3$d, jotta se täsmää leikkeen kehysnopeuden kanssa?";
changeTrailerRateTitle			= "Kehysnopeudet eivät täsmää";
changeTrailerRateMessage		= "Leikkeen kehysnopeus on %1$d ja trailerin kehysnopeus on %2$d. Haluatko muuttaa trailerin kehysnopeudeksi %3$d, jotta se täsmää leikkeen kehysnopeuden kanssa?";
change					= "Muuta";
dontChange					= "Älä muuta";

moveProjectButton1			= "Siirrä projekti (%@)"; 
moveProjectButton2			= "Siirrä projekti ja tapahtumat (%@)"; 
moveProjectsButton1			= "Siirrä projektit (%@)"; 
moveProjectsButton2			= "Siirrä projektit ja tapahtumat (%@)"; 

copyProjectButton1			= "Kopioi projekti (%@)"; 
copyProjectButton2			= "Kopioi projekti ja tapahtumat (%@)"; 
copyProjectsButton1			= "Kopioi projektit (%@)"; 
copyProjectsButton2			= "Kopioi projektit ja tapahtumat (%@)"; 

consolidateButton1			= "Kopioi tapahtumat (%@)"; 
consolidateButton2			= "Kopioi leikkeet (%@)"; 
consolidateButton3			= "Siirrä tapahtumat (%@)"; 

showEventLibrary				= "Näytä tapahtumakirjasto";
hideEventLibrary				= "Kätke tapahtumakirjasto";
showProjectLibrary			= "Näytä projektikirjasto";
hideProjectLibrary				= "Kätke projektikirjasto";
showKeywordFilter				= "Näytä avainsanasuodin";
hideKeywordFilter				= "Kätke avainsanasuodin";
enterFullscreen				= "Koko näyttö";
exitFullscreen				= "Koko näyttö pois";

undoUnRender				= "Poista mediaselaimesta";
undoSpaceSaver				= "Tilansäästäjä";

undoAddCutaway				= "Lisää leikkauskuva";
undoAddPIP					= "Lisää kuva kuvassa";
undoAddGreenScreen			= "Lisää vihreä tausta";
undoAddBlueScreen			= "Lisää sininen tausta";
undoAddSideBySide			= "Lisää vierekkäin";
undoRemoveCutaway			= "Poista";
undoMoveCutaway				= "Siirrä";
undoResizeCutaway			= "Muuta kokoa";

placementMode				= "Sijoitustyyli";
placementStart				= "Sijainti";
placementEnd				= "Sijainti";
placementRotation				= "Pyöritys";

volume					= "Äänenvoimakkuuden taso";
normalizeGain				= "Normalisoi";
normalizeClipVolume			= "Normalisoidaan leikkeen äänenvoimakkuutta";
audioDucking				= "Äänen vaimennus";
duckingAmount				= "Vaimennuksen määrä";

fadeInDuration				= "Alkuhäivytyksen kesto";
fadeOutDuration				= "Loppuhäivytyksen kesto";
manualFadeIn				= "Häivytys sisään käsin";
manualFadeOut				= "Häivytys ulos käsin";

colorBalance.X				= "Punaisen vahvistus";
colorBalance.Y				= "Vihreän vahvistus";
colorBalance.Z				= "Sinisen vahvistus";

overlapType					= "Päällekkäisyyden tyyppi";

equalizer.enable				= "Taajuuskorjain";
equalizer.presetIndex			= "Taajuuskorjaimen esiasetus";
equalizer.v0					= "Taajuuskorjaimen asetus";
equalizer.v1					= "Taajuuskorjaimen asetus";
equalizer.v2					= "Taajuuskorjaimen asetus";
equalizer.v3					= "Taajuuskorjaimen asetus";
equalizer.v4					= "Taajuuskorjaimen asetus";
equalizer.v5					= "Taajuuskorjaimen asetus";
equalizer.v6					= "Taajuuskorjaimen asetus";
equalizer.v7					= "Taajuuskorjaimen asetus";
equalizer.v8					= "Taajuuskorjaimen asetus";
equalizer.v9					= "Taajuuskorjaimen asetus";

noiseReducer.enable			= "Kohinan vaimennus";
noiseReducer.level			= "Kohinan vaimennuksen taso";

correctRollingShutter			= "Pyörivän sulkimen korjaus";
rollingShutterAmount			= "Pyörivän sulkimen korjaus";

description					= "Kuvaus";
transition					= "Siirros";

playSelection				= "Toista valinta";
playClip					= "Toista leike";
playVoiceOver				= "Toista selostus";
playTitle					= "Toista nimike";
playMusic					= "Toista musiikki";
playCutaway				= "Toista valinta";

loopSelection				= "Silmukoi valintaa";
loopClip					= "Silmukoi leikettä";
loopVoiceOver				= "Silmukoi selostusta";
loopTitle					= "Silmukoi otsikkoa";
loopMusic					= "Silmukoi musiikkia";
loopCutaway				= "Silmukoi valintaa";

showFonts					= "Näytä fontit";
hideFonts					= "Kätke fontit";

windowTitleFormat				= "%1$@ - (%2$@)";

timeScale0					= "1/4 s";
timeScale1					= "0,5 s";
timeScale2					= "1 s";
timeScale3					= "2 s";
timeScale4					= "5 s";
timeScale5					= "10 s";
timeScale6					= "30 s";
timeScale7					= "Koko";

timeScaleDescription0			= "sekunnin neljäsosa";
timeScaleDescription1			= "puoli sekuntia";
timeScaleDescription2			= "1 sekunti";
timeScaleDescription3			= "2 sekuntia";
timeScaleDescription4			= "5 sekuntia";
timeScaleDescription5			= "10 sekuntia";
timeScaleDescription6			= "30 sekuntia";
timeScaleDescription7			= "Kaikki kehykset";

notMarked					= "- Ei avainsanoja -";

markerDeleteTitle				= "Poista iskumerkki";
markerDeleteMessage			= "Mitä haluat tehdä tähän iskumerkkiin liittyvälle editoinnille?";
markerDeleteLeave			= "Jätä ennalleen";
markerDeleteExtendRight		= "Laajenna oikealle";
markerDeleteExtendLeft			= "Laajenna vasemmalle";

cannotPinMusicTitle			= "Kohdista iskuihin on käytössä";
cannotPinMusicMessage			= "Taustamusiikkileikkeitä ei voida siirtää, kun Kohdista iskuihin on käytössä.\r\rJos haluat siirtää tätä leikettä, poista Kohdista iskuihin käytöstä Sisältö-valikosta.";

snapInsertDeleteTitle			= "Kohdista iskuihin on käytössä";
snapInsertDeleteMessage		= "Tämä aiheuttaa sen, että nykyiset editoinnit eivät ole synkronoituja iskumerkkien kanssa tämän pisteen jälkeen.";

/* These format strings are used mostly for display, but they are also used
   to create the default values in timecode text entry fields, which have validation rules.
   Any literal characters that appear here must also be in 'validTimecodeCharacters'.
   These formats CANNOT contains periods or NSLocaleDecimalSeparators as literal characters:
   For example, "%d Sec." will break timecode textfield entry. 
   See rdar://6406494/ for more information.  */
hoursFormat				= "%1$d:%2$02d:%3$02d";
hoursFormatTenths			= "%1$d:%2$02d:%3$02d%4$@%5$01d";
minutesFormat				= "%1$d:%2$02d";
minutesFormatTenths			= "%1$d:%2$02d%3$@%4$01d";
justSecondsFormat			= "%d";
framesFormat				= "%1$@:%2$02d";
tensFormat					= "%d s";
tensFormatTenths				= "%1$d%2$@%3$01d s";
secondsTenthsFormat			= "%1$d%2$@%3$d s";
secondsFormat				= "%d s";

readableHoursFormat			= "%1$d %2$@ %3$02d %4$@ %5$02d %6$@";
readableHoursFormatTenths		= "%1$d %2$@ %3$02d %4$@ %5$02d%6$@%7$01d %8$@";
readableMinutesFormat			= "%1$d %2$@ %3$02d %4$@";
readableMinutesFormatTenths		= "%1$d %2$@ %3$02d%4$@%5$01d %6$@";
readableJustSecondsFormat		= "%1$d %2$@";
readableFramesFormat			= "%1$@ %2$02d %3$@";
readableTensFormat			= "%1$d %2$@";
readableTensFormatTenths		= "%1$d%2$@%3$01d %4$@";
readableSecondsTenthsFormat		= "%1$d%2$@%3$d %4$@";
readableSecondsFormat			= "%1$d %2$@";

printMenuItem				= "Tulosta...";
printProject					= "Tulosta projekti...";
printEvent					= "Tulosta tapahtuma...";

projectStatusOne				= "1 projekti";
projectStatusMany				= "%d projektia";

noClipsTitle					= "Ei leikkeitä";
noClipsMessage				= "Projektissa ei ole vietäviä leikkeitä.";

missingMedia				= "Lähdeleike puuttuu.";

badDiskDontWarnAgain			= "Älä varoita enää";
badDiskFormatMessage			= "Ulkoisen levyn muoto ei ole yhteensopiva iMovien kanssa. Levylle tallennettu video ei näy tapahtumakirjastossa.";
badDiskFormatMessage2			= "Taltio ei ole yhteensopiva iMovien kanssa.";
noUsableDiskTitle				= "Ei sopivia levyjä";
noUsableDiskMessage			= "Kotihakemisto on ei-tuetussa muodossa olevalla levyllä, juurihakemisto on kirjoitussuojattu ja muita levyjä ei löytynyt. Liitä ulkoinen kovalevy tai luo kirjoitettavissa oleva kansio nimeltään ”iMovie Events” kovalevyn juuritasolle.";

format0MB					= "0 Mt";
/* Note: for 3 strings below, do not localize the period (.) in these strings, it is translated to the correct locale string in the code */
formatMB					= "%1.1f Mt";
formatGB					= "%1.1f Gt";
formatTB					= "%1.1f Tt";

kilometersDistanceFormat		= "%d km";
milesDistanceFormat			= "%d mailia";

freespaceFormat				= "%@ vapaana";
tapeSizeFormat				= "%@";

songsIn					= "Kappaleet kohteessa %@";
musicLabel					= "%1$@ - %2$@";

adjustDuration				= "Leiketrimmeri";
adjustMusicDuration			= "Leiketrimmeri";
adjustClipDuration				= "Leiketrimmeri";
adjustStillDuration				= "Leiketrimmeri";
adjustVoiceOverDuration			= "Leiketrimmeri";
adjustSoundEffectDuration		= "Leiketrimmeri";

nameInUseTitle				= "Nimi käytössä";
nameInUseMessage			= "Määritetty nimi on jo käytössä.";

RCSelectedRangeType			= "Suosikki";
RCRejectedRangeType			= "Hylätty";
RCShakyRangeType			= "Liiallinen tärinä";
RCPanLeftRangeType			= "Panorointi vasemmalle";
RCPanRightRangeType			= "Panorointi oikealle";

RC_PD_PeopleRangeType		= "Ihmisiä";
RC_PD_1PersonRangeType		= "Yksi ihminen";
RC_PD_2PersonRangeType		= "Kaksi ihmistä";
RC_PD_GroupRangeType		= "Ryhmä";
RC_PD_CloseRangeType			= "Lähikuva";
RC_PD_MediumRangeType		= "Puolikuva";
RC_PD_FarRangeType			= "Kokokuva";
NoPeopleDetected				= "Ihmisiä ei havaittu.";
DetectingPeople				= "Havaitaan ihmisiä";

volumeNameFree				= "%1$@ (%2$@ vapaana)";
volumeNameFreeMin			= "%1$@ (%2$@ vapaana / %3$d min)";
volumeNameFreeHourMin		= "%1$@ (%2$@ vapaana / %3$d t %4$d min)";
volumeNameFreeHoursMin		= "%1$@ (%2$@ vapaana / %3$d t %4$d min)";
importTapeName				= "Uusi tapahtuma";
needCustomNameTitle			= "Ei tapahtuman nimeä";
needCustomNameMessage		= "Valitse olemassa oleva tapahtuma tai syötä nimi uudelle tapahtumalle.";
importButton				= "Tuo";
newEventName				= "Uusi tapahtuma %@";
event						= "Tapahtuma";

lastImport					= "Viimeisin tuonti";

titleReplaceSimilarFormat		= "Korvaa samanlaiset (%d)";
titleReplaceAllFormat			= "Korvaa kaikki (%d)";

stabilizeErrorTitle				= "Analyysivirhe";
stabilizeErrorMessageSingular		= "Analysoitaessa leikettä vakauttamista varten tapahtui virhe.";
stabilizeErrorMessagePlural		= "Analysoitaessa yhtä tai useampaa leikettä vakauttamista varten tapahtui virhe.";
stabilizeErrorMessageNeutral		= "Analysoitaessa leikkeitä vakauttamista varten tapahtui virhe.";

stabilizationProgressFormat		= "Leike %1$d / %2$d";

completelyStabilized			= "Vakautus analysoitu";
/* used for undo menu */
stabilizeMax					= "Vakautus";
/* used for undo menu */
stabilize					= "Vakautus"; 

stateCountryFormat			= "%1$@, %2$@";
/* Used in the map location dialog to display the results of airport searches. For example: "Phoenix, U.S.A" */
cityCountryFormat				= "%1$@, %2$@";
/* Used in the map location dialog to display the results of airport searches. For example: "Phoenix, Arizona, U.S.A" */
cityStateCountryFormat			= "%1$@, %2$@, %3$@";
/* Used in the map location dialog to display the results of airport searches. For example: "PHX - Phoenix Sky Harbor International Airport" */
airportNameFormat			= "%1$@ - %2$@";

mapCreationProgress			= "Luodaan maailmankarttaa";
loadingMapsProgressMsg			= "Ladataan karttaa";

customLocation				= "Muokattu sijainti";

clipsInUseTitle				= "Leikkeet käytössä";
clipInUseTitle				= "Leike käytössä";
clipsInUseMessage				= "Yhtä tai useampaa valituista leikkeistä käytetään projektissa.";
clipInUseMessage				= "Valittua leikettä käytetään projektissa.";
moveClipToTrash				= "Siirrä koko leike roskakoriin";
moveClipsToTrash				= "Siirrä kokonaiset leikkeet roskakoriin";

/* the following set of 8 strings appear when a user choose File > Import Movies..." and selects a directory. */
importRecursive-title			= "Tuodaanko koko hakemisto?";
importRecursive-msg			= "Olet valinnut tuotavaksi hakemiston, jossa on %1$d kohdetta.%2$@ Jatketaanko?";
importRecursive-tooMany		= "  (Kohteita saattaa olla enemmän, mutta vain ensimmäiset %d kohdetta tuodaan.)";
importRecursive-none-title		= "Ei tuotavaa";
importRecursive-none-msg		= "Valitsit tuotavaksi hakemiston, mutta sen sisältä ei löytynyt tuotavissa olevia tiedostoja. Valitse toinen hakemisto tai tiedosto.";
importRecur-progress-title		= "Skannataan";
importRecur-progress-upper		= "Etsitään tuotavissa olevia tiedostoja...";
importRecur-progress-lower		= "Skannattu %1$u kohdetta / %2$u kohdetta tuotavissa";

/* these strings appear when choosing File > Import... > Camera Archive */
/* appears on the accessory view in the open panel */
RADArchiveImport-findMsg		= "Valitse kansio, joka on kamera-arkisto";
RADArchiveImport-foundMsg		= "Kamera-arkisto havaittu. Jatka osoittamalla Tuo";
/* appears in alert panel if the user tries to import something that is not an archive */
NotARADArchive-title		= "Kansio ei ole kamera-arkisto";
NotARADArchive-msg			= "Valitse kansio, joka on kamera-arkisto, ja osoita Tuo.";

/* alert appears when dragging and dropping in a file onto the event/project outline view which only RAD can handle */
RADDragDropFile-title			= "Tuonti vaaditaan";
RADDragDropFile-msg			= "Jos haluat käyttää tätä tiedostoa tai kansiota iMoviessa, se on tuotava Kamerasta tuonti ‑ikkunan avulla. Haluatko avata Kamerasta tuonti ‑ikkunan nyt?";
RADDragDropFile-button = "Avaa";

captureImport				= "Tuo...";
captureImportAll				= "Tuo kaikki...";
captureImportSelected			= "Tuo valitut...";
captureCapture				= "Kaappaa...";
captureCancel				= "Lopeta";

voiceOverGetReady			= "Valmistaudu...";
voiceOverRecording			= "Tallennetaan";
voiceOverRecordingName		= "Selostustallenne.caf";
voiceOverDefaultInput			= "Sisäinen mikrofoni";
voiceOverTitle				= "%1$@ - %2$@";

importErrorTitle				= "Tuontivirhe";
importErrorMessage			= "Projekti ”%@” ei sisällä elokuvia, jotka voidaan tuoda.";
importCopyErrorMessage		= "Kopioitaessa elokuvia projektista ”%@” tapahtui virhe.";
completionMessageFormatOne		= "Videota tuotiin noin %1$d minuutti%2$@.";
completionMessageFormatMany	= "Videota tuotiin noin %1$d minuuttia%2$@.";
completionMessageDidRewind		= " ja nauha kelattiin alkuun";

startLabel					= "Alku";
endLabel					= "Loppu";

skimmingExtensionDots			= "...";

unknownCity				= "Tuntematon kaupunki";
unknownCountry				= "Tuntematon maa";

blackLevel					= "Mustan taso";
whiteLevel					= "Valkoisen taso";
brightness					= "Kirkkaus";
contrast					= "Kontrasti";
exposure					= "Valotus";
saturation					= "Kylläisyys";
colorOffset					= "Valkopiste";

keyGarbageMatte				= "Rajaa";
keyGarbageMatteUL			= "Rajauspiste";
keyGarbageMatteUR			= "Rajauspiste";
keyGarbageMatteLR			= "Rajauspiste";
keyGarbageMatteLL			= "Rajauspiste";
keyCleanPlate				= "Poista tausta";
manualFade					= "Tehosteen tyyppi";
fadeDuration				= "Häivytyksen kesto";
pipType					= "Tehosteen tyyppi";
pipBorderThicknessIndex		= "Reunan paksuus";
pipBorderColorIndex			= "Reunan väri";
pipVector					= "Sijainti";
pipShadow					= "Varjo";
cutawayOpacity				= "Peittävyys";

videoStyle					= "Videotehoste";
audioStyle					= "Äänitehoste";
extra						= "Tausta";

titleString1					= "Otsikon teksti tähän";
titleString2					= "Alaotsikon teksti tähän";
titleDirectedBy				= "Ohjannut";
titleAnd					= "ja";
titleStarring					= "Pääosissa";
/* Used by the Comic Book main title */
titleIssueNumber1				= "Numero 1";
titleGameTime				= "00:30";
lowercaseTitleStarring			= "pääosissa";
uppercaseTitleString1			= "OTSIKON TEKSTI TÄHÄN";
uppercaseTitleString2			= "ALAOTSIKON TEKSTI TÄHÄN";
uppercaseTitleStarring			= "PÄÄOSISSA";
uppercaseTitleAnd				= "JA";
uppercaseTitleDirectedBy		= "OHJANNUT";
uppercaseTitleLive				= "LIVE";
uppercaseTitlePlayerStats		= "PELAAJATILASTOT";
uppercaseTitleUpdate			= "PÄIVITYS";
titleTeams					= "Joukkueet";
titleScore					= "Tilanne";

photoAlbumName				= "Oma kuva-albumi";
scrapbookName				= "Oma leikekirja";
defaultName				= "Minä";

sportsTitleMainString			= "Aloitus";

editInsufficientContentTitle		= "Muokkausvaroitus";
editInsufficientContentMessage		= "Nykyisen valinnan käyttäminen lyhentää projektia. Haluatko jatkaa?";

moreMusic					= "♫...";
withBeatMarker				= "%@ - 1 iskumerkki";
withBeatMarkers				= "%1$@ - %2$d iskumerkkiä";
trimmingDuration				= "%@ kesto";

/* used for tooltip when adjusting volume */
percentageFormat				= "%d %%";

/* transport states */
kUnknownState				= "Tietoliikennevirhe";
kDisconnectedState			= "Ei yhteydessä tai pois päältä";
kImporting					= "Tuodaan...";
kStopped					= "Pysäytetty";						
kPlaying					= "Toista";
kStepFrameFwd				= "Askella eteenpäin";			
kStepFrameBack				= "Askella taaksepäin";
kRewinding					= "Kelataan…";
kFastForwarding				= "Kelaa eteenpäin…";
kPlayPaused				= "Keskeytetty";	
kSeekFwd					= "Selataan eteenpäin";
kSeekBack					= "Selataan taaksepäin";
kRecording					= "Tallennetaan";
kRecordPaused				= "Valmiina tallentamaan";
kNoTape					= "Ei nauhaa";
kTapeTrayOpen				= "Nauhakotelo avoinna";
kTapeTrayClosed				= "Nauhakotelo sulkeutuu";
kNoDeviceControl				= "Ei laiteohjausta";	
kDeckInErrorState				= "Tietoliikennevirhe";

/* HDV capture messages displayed while HDV camera is playing back (lower right corner of window) */
HDVCaptureBuffer-Previewing		= "Esikatsellaan";
HDVCaptureBuffer-Capturing		= "Kaapataan";
/* 1st Argument is one of the two strings above, e.g. "Capturing" or "Previewing". */
HDVCaptureBuffer-FullSpeed		= "%@ teräväpiirtovideota tosiaikaisesti";
HDVCaptureBuffer-ThreeQuarterSpeed = "%@ teräväpiirtovideota 3/4-nopeudella";
HDVCaptureBuffer-HalfSpeed		= "%@ teräväpiirtovideota 1/2-nopeudella";
HDVCaptureBuffer-QuarterSpeed	= "%@ teräväpiirtovideota 1/4-nopeudella";
HDVCaptureBuffer-SlowestSpeed	= "%@ teräväpiirtovideota 1/8-nopeudella";

iSightIrisClosed				= "iSightin iiris on suljettu";
iSightLidClosed				= "Kansi suljettu";
iSightBusy					= "Kamera toisen ohjelman käytössä";
iSight720					= "1280x720";
iSight576					= "1024 x 576";
WebCamNoMic-title			= "Mikrofonia ei löytynyt";
WebCamNoMic-msg			= "Voit edelleen tallentaa videota kameralla, mutta ääntä ei tallenneta.";
NoCamsConnected-upper		= "Kameraa ei ole liitetty";
NoCamsConnected-lower			= "Tuo videokuvaa liittämällä kamera tietokoneeseen.";
CamsBusy-upper				= "Kamera varattu";
CamsBusy-lower				= "Kamera on liitetty, mutta se on toisen ohjelman käytössä. Lopeta toinen ohjelma ja yritä uudelleen.";
RADIgnoringUDFOnTiger-title		= "AVCHD-laitetta ei tueta";
RADIgnoringUDFOnTiger-msg		= "OS X 10.4 ei tue teräväpiirto-DVD-videokameroita. Vaihda videokamera normaalitarkkuustilaan.";
RADIgnoringAVCHDOnPPC-msg		= "AVCHD-videon kaappaamiseen tarvitaan Intel Core Duo -pohjainen Macintosh; yritä vaihtaa videokameran asetukset normaalitarkkuuteen.";
RADCamMounting-title			= "Etsitään kameroita ja laitteita...";
/* this format string is used when a single camera has multiple volumes, e.g. a memory card and hard disk. */
/* the device name is followed by the volume name, e.g. "Sony Bloggie (NO NAME)" and "Sony Bloggie (Untitled)". */
/* the string appears in the camera popup in the lower left of the camera import window. */
RADCamMultiMountFormat			= "%1$@ (%2$@)";

/* these strings are appended to the name that appears in the RAD device popup (bottom left of camera window) */
/* when we see a camera with multiple kinds of content, such as AVCHD and MPEG2, on the same device */
RADVolumeFormat-Other = "(Muu)";
RADVolumeFormat-AVCHD = "(AVCHD)";
RADVolumeFormat-QuickTime = "(MPEG-4)";
RADVolumeFormat-MPEG2 = "(MPEG-2)";

AFCPairingFailed-title = "Suojattu laite";
/* The argument is the device's friendly name, e.g. "Jon Doe's iPhone". If it can't be found, AFCUnknownDeviceName will be shown. */
AFCPairingFailed-msg = "iMovie ei voinut yhdistää laitteeseen ”%@”, koska se on lukittu pääsykoodilla. Irrota laite tietokoneesta ja syötä pääsykoodi ennen kuin laitetta voidaan käyttää iMovien kanssa.";
AFCUnknownDeviceName = "(Tuntematon)";

/* RADMiniDVD-title				= "Mini DVD Detected"; */
/* RADMiniDVD-upper				= "If the DVD is from a compatible camcorder, the capture window will open automatically when ready. This may take several minutes."; */
RADCamPreparing-title			= "Valmistellaan tuontia";
/* not used - RADCamPreparing-upper			= ""; */
RADCamThumbnailing-title		= "Luodaan tunnistekuvia";
/* not used -- RADCamThumbnailing-upper		= ""; */
CantImportNoWritable-upper		= "Ei kirjoitettavissa olevia taltioita";
CantImportNoWritable-lower		= "Jotta voit kaapata videota, levylle on voitava kirjoittaa.";
CaptureCantCreateTapeFolder-title	= "Tapahtumaa ei voida luoda";
CaptureCantCreateTapeFolder-msg	= "Tuonti peruttiin. Sinulla ei ehkä ole oikeutta kirjoittaa kohteeseen %@.";
RADImportAll				= "Tuo kaikki...";
RADImportMarked				= "Tuo valitut...";
RADImportSelected			= "Tuo valitut...";
/* used when we are in 'automatic' import mode, but some clips won't be imported because we already have them or are incompatible */
RADImportVague				= "Tuo...";
/* The %d is a number, the %@ following it is either RADClipSingular or RADClipPlural */
RADIngestErrorV2-title		= "Kamerassa on %1$d %2$@, joita iMovie ei voinut tuoda.";
RADIngestErrorV2-msg		= "Jos haluat varmuuskopioida kaikki kameran leikkeet kovalevylle, osoita Arkistoi kaikki.";
RADIngestErrorV2-ArchiveBtn	= "Arkistoi kaikki";
/* In the case of MPEG4 media, we don't support camera archives, so display a different message for the same error */
RADIngestErrorMPEG4-msg		= "Voit käyttää Arkisto-valikon kohtaa Tuo > Elokuvia... tuodaksesi virheellisiä leikkeitä. Jos kohdistat osoittimen ongelmaleikkeen kohdalle, työkaluvihje näyttää alkuperäisen tiedostonimen.";
RADIngestErrorAFC-msg		= "Voit ehkä käyttää iPhotoa tai Kuvansiirtäjää tuodaksesi virheelliset leikkeet.";

/* tooltip format - the final argument is used for displaying the MPEG4 source filename, if appropriate */
RADClipTooltipFormat		= "Leike tallennettu: %1$@%2$@";

/* These strings are used if we run low on disk space, either before starting ingest, or during ingest */
RADLowDiskSpacePreflight-title = "Kovalevyllä ei ehkä ole riittävästi tilaa valittujen leikkeiden tuomiseen.";
RADLowDiskSpacePreflight-msg= "Sinulla on %1$@ vapaata tilaa ja tarvitset noin %2$@. Tee tilaa kovalevylle osoittamalla Kumoa ja poistamalla tiedostoja tai videoleikkeitä ja yritä uudelleen.";
RADLowDiskSpaceBtn-tryAnyway= "Jatka";
RADLowDiskSpaceBtn-stop = "Kumoa";
RADLowDiskSpaceDuring-title = "Jäljellä olevia leikkeitä ei tuoda, koska kovalevyllä ei ole tarpeeksi tilaa.";
RADLowDiskSpaceDuring-msg = "Vapauta kovalevytilaa poistamalla tiedostoja tai videoleikkeitä ja yritä uudelleen.";

/* the following two strings are used in the RADIngestError/RADCompleted format strings below that */
RADClipSingular				= "leike";
RADClipPlural				= "leikettä";
RADCompleted-title			= "Tuonti suoritettu";
RADCompleted-minsMsg			= "Tuotiin %1$d minuuttia ja %2$d sekuntia. Leikemäärä: %3$d %4$@.";
RADCompleted-minsNoSecsMsg		= "Tuotiin %1$d minuuttia. Leikemäärä: %2$d %3$@.";
RADCompleted-minMsg			= "Tuotiin minuutti ja %1$d sekuntia. Leikemäärä: %2$d %3$@.";
RADCompleted-minNoSecsMsg		= "Tuotiin 1 minuutti. Leikemäärä: %1$d %2$@.";
RADCompleted-secsMsg			= "Tuotiin %1$d sekuntia. Leikemäärä: %2$d %3$@.";

RADCompletionFormat			= "%@ kunnes valmis";
RADCellComplete				= "Tuotu";
RADCellError				= "Virhe";
RADClipProgressFormat			= "Tuodaan leikettä %1$d / %2$d";

/* when our eject button doesn't do the job */
RADCouldntEjectDisk-title		= "Laitetta ei voitu poistaa näkyvistä";
RADCouldntEjectDisk-msg		= "Sulje muut avoimet ohjelmat ja yritä laitteen poistamista näkyvistä Finderissa.";

/* this message is not currently used, but may be needed in the future */
RADDeleteConfirmMessage		= "Haluatko varmasti poistaa alkuperäiset tiedostot tallentimesta iMovieen tuonnin jälkeen?";

/* speakable descriptions/help */
/* clip description - the clip's 'checked' status, clip #, shooting time, and duration */
axRADClipBlankDescription		= "Tyhjä sijainti. Selaa vasemmalle";
axRADClipDescriptionFormat		= "%1$@ leike %2$d tallennettu %3$@ %4$@";
axRADCompletionFormat			= "%1$d minuuttia %2$d sekuntia jäljellä";
 /* last arg is axRADCompletionFormat */
axRADClipIngestingFormat		= "Leikettä tuotu %1$d prosenttia, %2$@";
axRADClipIngestingError			= "Leikettä ei voitu tuoda";
axRADClipIngestedOKMessage		= "Leike tuotiin normaalisti";
axRADClipDescChecked			= "Valittu";
axRADClipDescUnchecked		= "Valitsematon";
axRADMatrixHelpAutoMode		= "Kaappaus on automaattisessa tilassa. Kaikki uudet leikkeet tuodaan.";
axRADMatrixHelpManualMode		= "Kaappaus on manuaalisessa tilassa. Painamalla C-näppäintä voit tuoda tai olla tuomatta leikkeen.";
axRADClipHelpManualMode		= "Esikatsele painamalla välilyöntiä. Painamalla C-näppäintä voit tuoda tai olla tuomatta leikkeen";
axRADClipHelpAutoMode			= "Esikatsele painamalla välilyöntiä";
axRADClipRoleManualMode		= "esikatselu- tai tuontisäädin";
axRADClipRoleAutoMode			= "esikatselusäädin";
axRADPreviewDescription		= "esikatselu";

createArchiveMessage			= "Luo kopion kameran sisällöstä kovalevyllä olevaan kansioon.";
createArchivePrompt			= "Luo";
creatingArchive				= "Kopioidaan kameran sisältöä arkistoon...";
createArchiveFormat			= "%1$@ - %2$@";

/* Keyboard shortcut for closing the capture window - must be uppercase letter */
closeCaptureWindowKey			= "W"; 

/* Keyword HUD strings */
initialKeywords				= "Sisä,Ulko,Maisema,Lähikuva,Laajakuva,Ihminen,Lemmikki";
keywordToolMore				= "ja %d muuta";
keywordToolSeparator			= ", ";
keywordToolNoKeywords		= "Valittu alue ei sisällä avainsanoja";
keywordToolNoSelection			= "Ei valintaa";
keywordToolDeleteTitleOne		= "Poista avainsana";
keywordToolDeleteTitleMany		= "Poista avainsanat";
keywordToolDeleteOne			= "%1$d leikkeellä on avainsana ”%2$@”.\r\rHaluatko poistaa tämän avainsanan leikkeestä?";
keywordToolDeleteMany			= "%1$d leikkeellä on yksi tai usempi avainsanoista %2$@.\r\rHaluatko poistaa nämä avainsanat kaikista leikkeistä?";
keywordToolQuotedKeyword		= "”%@”";
keywordToolOr				= " tai ";
keywordToolRenameTitle		= "Nimeä avainsana uudelleen";
keywordToolRenameOne			= "%1$d leikkeellä on avainsana ”%2$@”.\r\rHaluatko muuttaa tämän avainsanan tässä leikkeessä?";
keywordToolRenameMany		= "%1$d leikkeellä on avainsana ”%2$@”.\r\rHaluatko muuttaa nämä avainsanat kaikissa leikkeissä?";

noKeywordsTitle				= "Avainsanoja ei ole valittu";
noKeywordsMessage			= "Valitse yksi tai useampi käytettävä avainsana.";

/* sharing strings */
youTubeSharingIdentifier		= "Valmistellaan projektia YouTubessa julkaisua varten…";
exportingProject				= "Viedään projektia…";
freezeDryingProject			= "Valmistellaan projektia…";
expertExportFailed-title			= "Elokuvaa ei voida viedä.";
expertExportFailed-msg			= "Elokuvaa ei voitu viedä, koska tapahtui virhe. (%@)";
freezeDryFailed-title			= "Projektia ei voida valmistella julkaisua varten.";
freezeDryFailed-msg			= "Projektia ei voitu valmistella julkaisua varten, koska tapahtui virhe. (%@)";
shareToYouTubeFailed-title		= "Ei voida julkaista YouTubessa.";
shareToYouTubeFailed-msg		= "Projektia ei voitu julkaista YouTubessa, koska tapahtui virhe. (%@)";
renderingMobile				= "Luodaan pientä elokuvaa...";
renderingSmall				= "Luodaan mobiilielokuvaa...";
renderingMedium				= "Luodaan keskikokoista elokuvaa...";
renderingLarge				= "Luodaan suurta elokuvaa...";
renderingHD720				= "Luodaan HD 720p -elokuvaa...";
renderingHD1080				= "Luodaan HD 1080p -elokuvaa...";
renderingiCodec				= "Luodaan elokuvaa…";
finalizeMissingEventsFormatOne	= "Seuraava tässä projektissa käytetty tapahtuma ei ole käytettävissä:\r\r%@\r\rProjektin osiot, jotka viittaavat tähän tapahtumaan, näkyvät mustina.";
finalizeMissingEventsFormat		= "Seuraavat tässä projektissa käytetyt tapahtumat eivät ole käytettävissä:\r\r%@\r\rProjektin osiot, jotka viittaavat näihin tapahtumiin, näkyvät mustina.";
finalizeMissingEventsFormatMany	= "Seuraavat tässä projektissa käytetyt tapahtumat eivät ole käytettävissä:\r\r%1$@ ja %2$d muuta...\r\rProjektin osiot, jotka viittaavat näihin tapahtumiin, näkyvät mustina.";
finalizeMissingEventsTitle			= "Mediaa puuttuu";
finalizeMissingAudioTitle			= "Puuttuvat äänitiedostot";
finalizeReviseMissingAudioFormat	= "Seuraava tässä projektissa käytetty äänitiedosto ei ole tällä hetkellä käytettävissä:\r\r%1$@\r\rMuutetaanko sijainniksi:\r\r%2$@?";
projectTooLong				= "Projekti on liian pitkä.";
memoryTooLow-title			= "Jakamiseen tarvitaan enemmän vapaata muistia";
memoryTooLow-msg			= "Lopeta iMovie ja avaa uudelleen";

finalizeMissingAudioFormatOne		= "Seuraava tässä projektissa käytetty äänitiedosto ei ole käytettävissä:\r\r%@\r\rProjektin osiot, jotka viittaavat tähän tiedostoon, ovat äänettömiä.";
finalizeMissingAudioFormat		= "Seuraavat tässä projektissa käytetyt äänitiedostot eivät ole käytettävissä:\r\r%@\r\rProjektin osiot, jotka viittaavat näihin tiedostoihin, ovat äänettömiä.";
finalizeMissingAudioFormatMany	= "Seuraavat tässä projektissa käytetyt äänitiedostot eivät ole käytettävissä:\r\r%1$@\rja %2$d muuta...\r\rProjektin osiot, jotka viittaavat näihin tiedostoihin, ovat äänettömiä.";

/* time remaining strings */
progressTime-format			= "Aikaa jäljellä: %@";
progressTime-manyHours		= "noin %ld tuntia";
progressTime-oneHour			= "noin tunti";
progressTime-manyMinutes		= "noin %ld minuuttia";
progressTime-oneMinute			= "noin minuutti";
progressTime-underOneMinute		= "alle minuutti";

/* MobileMe publishing strings */
dotMacPublish				= "Julkaise";
dotMacUpdate				= "Päivitä";
noNameMessage				= "Syötä albumille nimi.";
noUserNameMessage			= "Syötä käyttäjätunnus.";
noPasswordMessage			= "Syötä salasana.";
invalidMMLoginMessage			= "Virheellinen käyttäjätunnus tai salasana. Yritä uudelleen.";
uploadCancelTitle				= "Siirto kumottiin";
uploadTryAgain				= "Yritä uudelleen";
uploadInsufficientSpaceTitle		= "Liian vähän tilaa iDiskillä";
dotMacErrorTitle				= "Virhe siirron aikana";
dotMacFileSizeErrorMessage		= "Elokuvan tiedostokoko ylittää siirrettävien tiedostojen sallitun enimmäiskoon.";
uploadAgainTitle				= "Projekti julkaistu aiemmin";
uploadAgainMessage			= "Korvaa aiemmin siirretyt videot osoittamalla Jatka.";
dotMacMobileUpload			= "Siirretään pientä elokuvaa...";
dotMacSmallUpload			= "Siirretään mobiilielokuvaa...";
dotMacMediumUpload			= "Siirretään keskikokoista elokuvaa...";
dotMacLargeUpload			= "Siirretään suurta elokuvaa...";
unpublishButtonText			= "Lopeta julkaisu";
shareProjectToiTunes			= "iTunes…";
reshareProjectToiTunes			= "Julkaise uudelleen iTunesissa…";
dotMacPassword				= "SALASANA";
YouTubeVisitFormat			= "mailto:?subject=Minun hieno iMovieni!&body=Uusin ja hienoin iMovieni on katseltavissa YouTubessa. Voit katsella sen osoitteessa:\r\r%1$@\r%2$@\r\rToivottavasti pidät siitä!";
FacebookVisitFormat			= "mailto:?subject=Minun hieno iMovieni!&body=Uusin ja hienoin iMovieni on katseltavissa Facebookissa. Voit katsella sen osoitteessa:\r\r%1$@\r%2$@\r\rToivottavasti pidät siitä!";
VimeoVisitFormat				= "mailto:?subject=Minun hieno iMovieni!&body=Uusin ja hienoin iMovieni on katseltavissa Vimeossa. Voit katsella sen osoitteessa:\r\r%1$@\r%2$@\r\rToivottavasti pidät siitä!";
CNNVisitFormat				= "mailto:?subject=Minun hieno iReportini!&body=Uusin ja hienoin iReportini on katseltavissa CNN iReportilla. Voit katsella sen osoitteessa:\r\r%1$@\r%2$@\r\rToivottavasti pidät siitä!";

siteRemoveTextFormat			= "Poista projekti ensin sivulta %1$@ sivustolla %2$@ ja osoita sitten Valmis.";
siteRemoveButtonFormat		= "Palveluun: %@";

sharedBannerView				= "Vieraile";
sharedBannerTell				= "Kerro ystävälle";
sharedBannerPublish			= "Julkaise...";
sharedBannerPublishToFormat		= "Julkaise kohteessa %@…";
sharedBannerRepublish			= "Julkaise uudelleen";
sharedBannerRepublishToFormat	= "Julkaise uudelleen kohteessa %@…";
sharedBannerUnpublish			= "Lopeta julkaisu";
sharedBannerRemoveFromFormat	= "Poista kohteesta %@…";

dotMacSecondaryUserDefaultName	= "nimeton_kayttaja";

dotMacBadNamePasswordEntryTitle	= "Merkkiä ei sallita";
dotMacBadNamePasswordEntryMsg	= "Käyttäjätunnusten ja salasanojen on oltava enintään 20 merkkiä pitkiä ja koostuttava kirjaimista (a - z), numeroista (0 - 9), alaviivoista tai yhdestä pisteestä (.). Alaviivaa tai pistettä ei voida käyttää käyttäjätunnuksen tai salasanan alussa tai lopussa.";

flowNameFormat				= "%1$@ - %2$@";

/* Start - YouTube Sharing strings */
/* status messages */
YTProgressTitle				= "Julkaistaan YouTubessa";
YTConfirmingAuth				= "Varmistetaan valtuutusta…";
YTAuthConfirmed				= "Sinut on valtuutettu siirtämään";
YTGettingUploadURL			= "Haetaan lähetyssijaintia…";
YTCreatingUploadData			= "Luodaan lähetettävää elokuvaa…";
YTUploadingVideo				= "Siirretään elokuvaa…";
YTUploadComplete				= "Odotetaan kuittausta…";
YTPrepareUpload				= "Valmistellaan lähetystä…";

YTServiceUnavailable			= "YouTube-palvelu ei ole käytettävissä.";
YTError					= "Tapahtui virhe.";
YTPasswordNeeded			= "Syötä YouTube-tilin salasana.";
YTUserOrPasswordIncorrect		= "Virheellinen käyttäjätunnus tai salasana.";
YTAccountMigratedErrorTitle	= "YouTube ei enää tue videon lähettämistä alkuperäistä YouTube-käyttäjätunnusta ja salasanaa käyttäen.";
YTAccountMigratedError		= "Käytä YouTube-tiliisi yhdistettyä Google-käyttäjätunnusta ja salasanaa.";
YTNoLinkedYouTubeAccountTitle = "Sinulla ei ole tällä hetkellä Google-tiliin yhdistettyä YouTube-tiliä.";
YTNoLinkedYouTubeAccount	= "Yhdistä YouTube- ja Google-tilit ja julkaise uudelleen.";
YTGeneralError				= "YouTube raportoi virheestä.";
YTErrorUnknown				= "YouTube raportoi tuntemattomasta virheestä.";
YTErrorFileTooBigTitle			= "Projekti on liian suuri";
YTErrorFileTooBigMessage1		= "Palveluun %1$@ lähetettyjen projektien tulee olla kooltaan alle %2$@ ja kestoltaan alle %3$d minuuttia.";
YTErrorFileTooBigMessage2		= "Palveluun %1$@ julkaistujen projektien tulee olla kooltaan alle %2$@.";
YTErrorFileTooBigMessage3		= "Lyhennä projektiasi ennen julkaisemista kohteessa %@.";

YouTubeComplete				= "Video on siirretty YouTubeen. YouTube-palvelimen kuormasta riippuen saattaa kestää useita minuutteja tai tunteja ennen kuin video on käsitelty ja katseltavissa.";

/* Local UI errors (should never display if UI enablement is correct) */
YTNotLoggedIn-title			= "Sinua ei ole vielä valtuutettu siirtämään.";
YTNotLoggedIn-msg			= "Kirjaudu ensin sisään.";

/* YT Errors from their server */
YTAppError-title				= "Tietoliikennevirhe";
YTAppError-msg				= "Viestittäessä YouTube-palvelimen kanssa tapahtui virhe. Yksinkertaista kuvausta, otsikkoa ja tageja.";
YTSigError-title				= "Tietoliikennevirhe";
YTSigError-msg				= "Viestittäessä YouTube-palvelimen kanssa tapahtui virhe. Yksinkertaista kuvausta, otsikkoa ja tageja.";
YTBadUserError-title			= "Käyttäjän sisäänkirjautuminen epäonnistui";
YTBadUserError-msg			= "YouTube ei voinut varmentaa valittua käyttäjätunnusta. Poista tili osoittamalla Poista ja lisää tili uudelleen.";
YTInvalidCategory-title			= "Virheellinen kategoria";
YTInvalidCategory-msg			= "YouTube ei enää tue valittua kategoriaa. Valitse toinen kategoria.";

/* Other Errors */
YTNotXMLResponse-title			= "YouTuben sisäinen virhe";
YTNotXMLResponse-msg			= "Palvelin ei vastannut odotetuilla tiedoilla. Yritä myöhemmin uudelleen.";
YTUnexpectedXML-title			= "Tietoliikennevirhe";
YTUnexpectedXML-msg			= "YouTube palautti dataa, jota ei voitu käsitellä. Haluatko yrittää uudelleen?";
YTAuthFailed-title				= "Valtuutusvirhe";
YTAuthFailed-msg				= "Käsiteltäessä YouTuben valtuutustietoja tapahtui virhe. Kirjaudu ulos YouTube-verkkosivustolta ja yritä valtuutusta uudelleen täällä.";
YTURLError-title				= "Tietoliikennevirhe";
YTURLError-msg				= "Viestittäessä palvelimen kanssa tapahtui virhe. Varmista, että olet yhteydessä internetiin ja yritä uudelleen.";

YouTubePopupSmallSize			= "Mobiili - %@";
YouTubePopupMediumSize		= "Keskikokoinen - %@";
YouTubePage				= "Omat videot";
YouTubeSitename				= "YouTube";

/* General messages */
YTFileSelectedForUpLoad			= "YouTubessa julkaistavaksi valittu projektitiedosto: %@";
YTNoFileSelectedForUpLoad		= "Yhtään tiedostoa ei ole valittu siirrettäväksi.";

/* Dialog defaults if the user fails to enter something */
YTDefaultTitle				= "Oma hieno elokuvani";
YTDefaultDescription			= "Oma hieno elokuvani.";
 /* WARNING: This string must always be at least two characters long, no matter what the language. This is a YouTube requirement. */
 YTDefaultTags				= "Elokuva";

/* End - YouTube Sharing strings */

/* Facebook sharing strings */

FBProgressTitle				= "Julkaistaan Facebookissa";
FacebookComplete			= "Video on siirretty Facebookiin. Saattaa kestää jonkin aikaa ennen kuin video on käsitelty ja katseltavissa.";
FacebookPage				= "Video";
FacebookSitename			= "Facebook";

/* End - Facebook Sharing strings */

/* Facebook sharing strings */

VimeoProgressTitle			= "Julkaistaan Vimeossa";
VimeoComplete				= "Video on siirretty Vimeoon. Vimeo-palvelimen kuormasta riippuen saattaa kestää useita minuutteja tai tunteja ennen kuin video on käsitelty ja katseltavissa.";
VimeoPage					= "My Videos";
VimeoSitename				= "Vimeo";

/* End - Facebook Sharing strings */

/*CNN sharing strings */

CNNProgressTitle				= "Julkaistaan CNN iReportissa";
CNNComplete				= "Video on siirretty CNN iReportiin.";
CNNPage					= "Video";
CNNSitename				= "CNN iReport";
CNNLoginProblem				= "CNN iReportiin ei voida kirjautua";
CNNSiteButtonName			= "iReport";
CNNBodyOmitted				= "Tämän iReportin leipäteksti jätettiin pois, tämä on oletusteksti.";
CNNRemoveText				= "Pyydä CNN iReportia poistamaan projektisi verkkosivulta ja osoita sitten Valmis.";

/* End - CNN Sharing strings */

mediaTabAudio				= "Musiikki ja äänitehosteet";
mediaTabPhoto				= "Kuvat";
mediaTabTitle				= "Otsikot";
mediaTabTransition			= "Siirrokset";
mediaTabExtra				= "Kartat, taustat ja luonnosanimaatiot";
iMovieSoundEffectsFolderName		= "iMovie-ääniefektit";
iLifeSoundEffectsFolderName		= "iLife-ääniefektit";

/* iLife Sound Effect folder names */
Ambience					= "Tunnelma";
Animals					= "Eläimet";
Booms					= "Jylinät";
Foley						= "Foley";
Jingles					= "Tunnussävelet";
Machines					= "Koneet";
People					= "Ihmisiä";
Sci-Fi						= "Scifi";
Stingers					= "Stingerit";
Textures					= "Tekstuurit";
Transportation				= "Kuljetus";
"Work - Home"				= "Työ - koti";

/* Transitions */
Transition_CrossDissolve			= "Ristikuva";
Transition_CrossBlur			= "Ristihäivytys";
Transition_Cube				= "Kuutio";
Transition_PageCurl			= "Sivunkääntö vasen";
Transition_PageCurlRight			= "Sivunkääntö oikea";
Transition_WipeDown			= "Pyyhkäisy alas";
Transition_WipeLeft			= "Vasen pyyhkäisy";
Transition_WipeRight			= "Oikea pyyhkäisy";
Transition_WipeUp				= "Pyyhkäisy ylös";
Transition_PushDown			= "Työntö alas";
Transition_PushLeft			= "Työntö vasemmalle";
Transition_PushRight			= "Työntö oikealle";
Transition_PushUp				= "Työntö ylös";
Transition_SlideDown			= "Liuku alas";
Transition_SlideLeft			= "Liuku vasemmalle";
Transition_SlideRight			= "Liuku oikealle";
Transition_SlideUp				= "Liuku ylös";
Transition_FadeThroughBlack		= "Häivytys mustaan";
Transition_FadeThroughWhite		= "Häivytys valkoiseen";
Transition_CircleClose			= "Ympyrä suljettu";
Transition_CircleOpen			= "Ympyrä avoin";
Transition_Doorway			= "Oviaukko";
Transition_Swap				= "Vaihto";
Transition_CrossZoom			= "Ristizoomaus";
Transition_Mosaic				= "Mosaiikki";
Transition_SpinIn				= "Pyörähdys sisään";
Transition_SpinOut			= "Pyörähdys ulos";
Transition_PuzzleRight			= "Laatat oikealle";
Transition_PuzzleLeft			= "Laatat vasemmalle";

/* Dynamic Transitions */
DynamicTransition_BulletinBoard1	= "Ilmoitustaulu 1";
DynamicTransition_BulletinBoard2	= "Ilmoitustaulu 2";
DynamicTransition_BulletinBoard3	= "Ilmoitustaulu 3";
DynamicTransition_BulletinBoard4	= "Ilmoitustaulu 4";
DynamicTransition_ComicBook1	= "Sarjakuva 1";
DynamicTransition_ComicBook2	= "Sarjakuva 2";
DynamicTransition_ComicBook3	= "Sarjakuva 3";
DynamicTransition_ComicBook4	= "Sarjakuva 4";
DynamicTransition_Filmstrip1		= "Filmiraita 1";
DynamicTransition_Filmstrip2		= "Filmiraita 2";
DynamicTransition_Filmstrip3		= "Filmiraita 3";
DynamicTransition_Filmstrip4		= "Filmiraita 4";
DynamicTransition_PhotoAlbum1	= "Kuva-albumi 1";
DynamicTransition_PhotoAlbum2	= "Kuva-albumi 2";
DynamicTransition_PhotoAlbum3	= "Kuva-albumi 3";
DynamicTransition_PhotoAlbum4	= "Kuva-albumi 4";
DynamicTransition_Scrapbook1	= "Leikekirja 1";
DynamicTransition_Scrapbook2	= "Leikekirja 2";
DynamicTransition_Scrapbook3	= "Leikekirja 3";
DynamicTransition_Scrapbook4	= "Leikekirja 4";
DynamicTransition_News1		= "Uutislähetys 1";
DynamicTransition_News2		= "Uutislähetys 2";
DynamicTransition_News3		= "Uutislähetys 3";
DynamicTransition_News4		= "Uutislähetys 4";
DynamicTransition_Sports1		= "Urheilu 1";
DynamicTransition_Sports2		= "Urheilu 2";
DynamicTransition_Sports3		= "Urheilu 3";
DynamicTransition_Sports4		= "Urheilu 4";

/* Mica Transitions */
MicaThemeTransition-Bright		= "Valoisa";
MicaThemeTransition-iReport		= "iReport";
MicaThemeTransition-Kids		= "Leikkisä";
MicaThemeTransition-Modern		= "Moderni";
MicaThemeTransition-Neon		= "Neon";
MicaThemeTransition-News2		= "Uutiset";
MicaThemeTransition-Simple		= "Yksinkertainen";
MicaThemeTransition-Travel		= "Matkailu";

/* Styles */
Style_None					= "Ei mitään";
Style_BlackAndWhite			= "Mustavalkoinen";
Style_DayForNight				= "Päivä yöksi";
Style_DreamWarm			= "Uni";
Style_HighlightGlow			= "Hohto";
Style_SepiaWithColor			= "Seepia";
Style_BleachBypass			= "Valkaistu";
Style_Gloom				= "Sarjakuva";
Style_HFlip					= "Käännetty";
Style_heatwave				= "Lämpöaalto";
Style_Negative				= "Negatiivi";
Style_romantic				= "Romanttinen";
Style_sci-fi					= "Scifi";
Style_Grain					= "Rakeinen filmi";
Style_OldWorld				= "Vanha manner";
Style_XRay					= "Röntgen";
Style_HardLight				= "Kova valo";
Style_AgedFilm				= "Vanha filmi";
Style_Raster				= "Rasteri";
Style_vignette				= "Häivytetyt reunat";
Style_FilmNoir				= "Film noir";

/* Audio Styles */
none					= "Ei mitään";
muffled				= "Vaimennettu";
telephone				= "Puhelin";
echo					= "Kaiku";
radio					= "Lyhytaaltoradio";
robot					= "Robotti";
cosmic				= "Kosminen";
multitune				= "Monisointuinen";
reverb1				= "Pieni huone";
reverb2				= "Keskikok. huone";
reverb3				= "Suuri huone";
reverb4				= "Katedraali";
pitchdown4				= "Sävelkorkeus alas 4";
pitchdown3				= "Sävelkorkeus alas 3";
pitchdown2				= "Sävelkorkeus alas 2";
pitchdown1				= "Sävelkorkeus alas 1";
pitchup1				= "Sävelkorkeus ylös 1";
pitchup2				= "Sävelkorkeus ylös 2";
pitchup3				= "Sävelkorkeus ylös 3";
pitchup4				= "Sävelkorkeus ylös 4";

/* Titles */
Title-Centered				= "Keskitetty";
Title-LowerThird				= "Alin kolmannes";
Title-Scrolling				= "Lopputekstit";
Title-SemiTransBlack			= "Pehmeä - musta";
Title-SemiTransWhite			= "Pehmeä - valkea";
Title-TornEdgeBlack			= "Revitty - musta";
Title-TornEdgeTan				= "Revitty - ruskea";
Title-Expedition				= "Kaiku";
Title-FormalBands				= "Muodollinen";
Title-WhitePaper				= "Paperi";
Title-GradientBandBlack			= "Väriliuku - musta";
Title-GradientBandWhite			= "Väriliuku - valkea";
Title-Ticker					= "Uutisnauha";
Title-Drifting					= "Ajelehtiva";
Title-Zoom					= "Zoomaus";
Title-Clouds					= "Pilvet";
Title-SidewaysDrifting			= "Sivuttainen siirtymä";
Title-VerticalDrift				= "Pystysiirtymä";
Title-BlurHorizontal			= "Vaakasumennus";
Title-BlurVertical				= "Pystysumennus";
Title-DriftRightUp				= "Neljä kulmaa";
Title-DriftDownLeft				= "Neljä kulmaa";
Title-DriftLeftUp				= "Neljä kulmaa";
Title-DriftDownRight			= "Neljä kulmaa";
Title-PullFocus				= "Kohdistussiirto";
Title-Lower					= "Alempi";
Title-Upper					= "Ylempi";
Title-FarFarAway				= "Kauas pois";
Title-Overlap				= "Päällekkäin";
Title-WipingDissolve			= "Pehmeä reuna";
Title-DateTime				= "Päivä/aika";
Title-BoogieLights				= "Boogie-valot";
Title-Organic				= "Kasvit otsikko";
OrganicDefaultText			= "Charlotte ja William";
Title-OrganicLowerThird2			= "Kasvit alempi";
OrganicLowerThirdDefaultText		= "Häät";
Title-PixieDust				= "Keijupöly";
Title-LensFlare				= "Linssiheijastus";
Title-Documentary1			= "Dokumentti1";
Title-Documentary2			= "Dokumentti2";
Title-Action1					= "Toiminta1";
Title-Action2					= "Toiminta2";
Title-Sparkle				= "Säihke";
Title-Quest1					= "Etsintä1";
Title-Quest2					= "Etsintä2";
Title-Quest3					= "Etsintä3";
Title-Friendship2				= "Ystävyys2";

FarFarAwayDefault1			= "THINK DIFFERENT\n\nHere's to the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes. The ones who see things differently. They're not fond of rules. And they have no respect for the status quo. You can praise them, disagree with them, quote them, disbelieve them, glorify or vilify them. About the only thing you can't do is ignore them. Because they change things. They invent. They imagine. They heal. They explore. They create. They inspire. They push the human race forward. Maybe they have to be crazy. How else can you stare at an empty canvas and see a work of art? Or sit in silence and hear a song that's never been written? Or gaze at a red planet and see a laboratory on wheels? We make tools for these kinds of people. While some see them as the crazy ones, we see genius. Because the people who are crazy enough to think they can change the world, are the ones who do.";


/* Bulletin Board titles */
Title-BulletinBoardMain			= "Ilmoitustaulu";
Title-BulletinBoardLowerThird1		= "Alin kolmannes 1";
Title-BulletinBoardLowerThird2		= "Alin kolmannes 2";
Title-BulletinBoardUpperThird1		= "Ylin kolmannes";
Title-BulletinBoardCredits1		= "Lopputekstit 1";
Title-BulletinBoardCredits2		= "Lopputekstit 2";
Title-BulletinBoardCredits3		= "Lopputekstit 3";
Title-BulletinBoardSimple		= "Yksinkertainen";

/* Comic Book titles */
Title-ComicBookMain			= "Sarjakuva";
Title-ComicBookLowerThird1		= "Alin kolmannes 1";
Title-ComicBookLowerThird2		= "Alin kolmannes 2";
Title-ComicBookUpperThird1		= "Ylin kolmannes";
Title-ComicBookCredits1			= "Lopputekstit 1";
Title-ComicBookCredits2			= "Lopputekstit 2";
Title-ComicBookCredits3			= "Lopputekstit 3";
Title-ComicBookSimple			= "Yksinkertainen";

/* Filmstrip titles */
Title-FilmstripMain				= "Filmiraita";
Title-FilmstripLowerThird1		= "Alin kolmannes";
Title-FilmstripLowerThird2		= "Alin kolmannes 2";
Title-FilmstripUpperThird1		= "Ylin kolmannes";
Title-FilmstripCredits1			= "Lopputekstit 1";
Title-FilmstripCredits2			= "Lopputekstit 2";
Title-FilmstripCredits3			= "Lopputekstit 3";
Title-FilmstripSimple			= "Yksinkertainen";

/* Photo Album titles */
Title-PhotoAlbumMain			= "Kuva-albumi";
Title-PhotoAlbumLowerThird1		= "Alin kolmannes 1";
Title-PhotoAlbumLowerThird2		= "Alin kolmannes 2";
Title-PhotoAlbumUpperThird1		= "Ylin kolmannes";
Title-PhotoAlbumCredits1		= "Lopputekstit 1";
Title-PhotoAlbumCredits2		= "Lopputekstit 2";
Title-PhotoAlbumCredits3		= "Lopputekstit 3";
Title-PhotoAlbumSimple			= "Yksinkertainen";

/* Scrapbook titles */
Title-ScrapbookMain			= "Leikekirja";
Title-ScrapbookLowerThird1		= "Alin kolmannes 1";
Title-ScrapbookLowerThird2		= "Alin kolmannes 2";
Title-ScrapbookUpperThird1		= "Ylin kolmannes";
Title-ScrapbookCredits1			= "Lopputekstit 1";
Title-ScrapbookCredits2			= "Lopputekstit 2";
Title-ScrapbookCredits3			= "Lopputekstit 3";
Title-ScrapbookSimple			= "Yksinkertainen";

/* News titles */
Title-NewsMain				= "Uutislähetys";
Title-NewsLowerThird1			= "Alin kolmannes 1";
Title-NewsLowerThird2			= "Alin kolmannes 2";
Title-NewsLowerThird3			= "Alin kolmannes 3";

/* Sports titles */
Title-SportsMain				= "Ottelun aloitus";
Title-SportsCredits1			= "Lopputekstit";
Title-SportsLowerThird1			= "Alin kolmannes";
Title-SportsInstantReplay		= "Ylin kolmannes";
Title-SportsScore				= "Tilanne";
Title-SportsTeamVsTeam		= "Joukkue-joukkue";
Title-SportsPlayerStats			= "Pelaajatilastot";

/* Bright titles */
MicaThemeTitle-Bright-Opening		= "Aloitus";
MicaThemeTitle-Bright-Middle		= "Keskikohta";
MicaThemeTitle-Bright-Ending		= "Lopetus";

/* iReport titles */
MicaThemeTitle-iReport-Opening	= "Aloitus";
MicaThemeTitle-iReport-Middle		= "Keskikohta";
MicaThemeTitle-iReport-Ending		= "Lopetus";

/* Kids titles */
MicaThemeTitle-Kids-Opening		= "Aloitus";
MicaThemeTitle-Kids-Middle		= "Keskikohta";
MicaThemeTitle-Kids-Ending		= "Lopetus";

/* Modern titles */
MicaThemeTitle-Modern-Opening	= "Aloitus";
MicaThemeTitle-Modern-Middle		= "Keskikohta";
MicaThemeTitle-Modern-Ending		= "Lopetus";

/* Neon titles */
MicaThemeTitle-Neon-Opening		= "Aloitus";
MicaThemeTitle-Neon-Middle		= "Keskikohta";
MicaThemeTitle-Neon-Ending		= "Lopetus";

/* News2 titles */
MicaThemeTitle-News2-Opening	= "Aloitus";
MicaThemeTitle-News2-Middle		= "Keskikohta";
MicaThemeTitle-News2-Ending		= "Lopetus";

/* Simple titles */
MicaThemeTitle-Simple-Opening	= "Aloitus";
MicaThemeTitle-Simple-Middle		= "Keskikohta";
MicaThemeTitle-Simple-Ending		= "Lopetus";

/* Travel titles */
MicaThemeTitle-Travel-Opening	= "Aloitus";
MicaThemeTitle-Travel-Middle		= "Keskikohta";
MicaThemeTitle-Travel-Ending		= "Lopetus";

/* Strings from Mica documents */
TRAVEL_WISH_YOU_WERE_HERE	= "Olisitpa täällä!";

/* Tooltips */
toolEditTool					= "Muokkaustyökalu - E";
toolTagTool					= "Suosikkityökalu - F";
toolUntagTool				= "Merkinnän poistotyökalu - U";
toolRejectTool				= "Hylkäystyökalu - R";
toolKeywordTool				= "Avainsanatyökalu - K";

toolEditAction				= "Lisää valittu video projektiin - E";
toolTagAction				= "Merkitse valittu video suosikiksi - F";
toolUntagAction				= "Poista valitun videon valinta - U";
toolRejectAction				= "Hylkää valittu video - R";
toolKeywordAction				= "Katso valitun videon avainsanoja - K";

badgeTrimLeft				= "Hienosäädä leikkeen alkua osoittamalla";
badgeTrimRight				= "Hienosäädä leikkeen loppua osoittamalla";
badgeDetailTimeline			= "Näytä tarkkuuseditori osoittamalla";
badgeAudioAdjust				= "Osoittaa, että leikkeessä on käytetty äänisäätöjä. Muokkaa kaksoisosoittamalla.";
badgeVideoAdjust				= "Osoittaa, että leikkeessä on käytetty videosäätöjä. Muokkaa kaksoisosoittamalla.";
badgeCrop					= "Osoittaa, että leikkeessä on käytetty rajauksia, pyörityksiä tai Ken Burns -tehosteita. Muokkaa kaksoisosoittamalla.";
badgeStabilize				= "Osoittaa, että leikkeessä on käytetty vakautusta. Muokkaa kaksoisosoittamalla.";
badgeSpeed					= "Osoittaa, että leikkeen nopeutta on säädetty tai käännetty. Muokkaa kaksoisosoittamalla.";
badgeRate					= "Ilmaisee, että leikkeen kehysnopeus (%1$dfps) ei ole nykyisen projektin kerrannainen (%2$dfps).";
badgeMissingMedia			= "Leikkeen mediatiedosto ei ole tällä hetkellä käytettävissä.\r\r%@";

/* Help anchors */
SplashHelp-keyboardShortcuts			= "mov3ae8c33b";
SplashHelp-importingVideoOverview		= "mov6abad352";
SplashHelp-videoInspector			= "mov3a883b2e";
SplashHelp-audioInspector			= "movef528f3b";
SplashHelp-clipInspector				= "mov3b0fa5d3";
SplashHelp-fontSelector				= "mov3a621837";
SplashHelp-newProjectDialog			= "mov3a621c69";
SplashHelp-newTrailerDialog			= "mov3a621c69";
SplashHelp-consolidateMediaDialog		= "mov3ac6c7c9";
SplashHelp-teamEditorWindow			= "mov3a61dfb9";

AlreadyRunning					= "iMovie on jo avoinna.";
MustQuit						= "Ohjelma on lopetettava.";

/*-----------------------------------------------------------------------------------------------------------*/
/* Drag-installed iMovie to older OS */
missingCodec-title-singular		= "QuickTime-komponentti puuttuu";
missingCodec-title-plural			= "QuickTime-komponentteja puuttuu";
missingiCodec-msg			= "Teräväpiirtoelokuvien katselemiseen, muokkaamiseen, tuomiseen ja viemiseen tarvittavaa QuickTime-komponenttia ei ole asennettu. Tämä komponentti tulee iMovie-asentajan mukana. Asenna iMovie uudelleen.";
missingMPEGCodec-msg			= "MPEG2-elokuvien katselemiseen, muokkaamiseen, tuomiseen ja viemiseen tarvittavaa QuickTime-komponenttia ei ole asennettu. Tämä komponentti tulee iMovie-asentajan mukana. Asenna iMovie uudelleen.";
missingManyCodecs-msg			= "Erilaisten elokuvien katselemiseen, muokkaamiseen, tuomiseen ja viemiseen tarvittavia QuickTime-komponentteja ei ole asennettu. Nämä komponentit tulevat iMovie-asentajan mukana. Asenna iMovie uudelleen.";

/* New event name has invalid chars - a list of invalid chars is in NonLocalizable.strings */
invalidEventName-title			= "Virheellinen merkki";
invalidEventName-hidden		= "Pisteellä alkavat nimet on varattu järjestelmän käyttöön. Valitse toinen nimi.";
invalidEventName-invalidChars		= "Nimissä ei voida käyttää merkkejä / . * ? : ~ eikä rivinvaihtoa. Valitse toinen nimi.";

/* Upgrade checking mechanism */
/* application will fill in the version number (i.e.: "4.0.2") */
WebUpgradeNoNewUpdates		= "Tämä iMovie-versio (%1$@) on uusin versio.";  
WebUpgradeNetworkError		= "iMovie-päivityspalvelimeen ei voitu yhdistää. Tarkista internet-yhteys ja yritä uudelleen.";
WebUpgradeDialogTitle			= "iMovie-päivitys";
WebUpgradeCheckingText		= "Etsitään päivityksiä…";

/* no ~/Movies directory, and we couldn't make a new one either */
/* NOTE: the Finder localizes the appearance of 'Movies',       */
/* even though that's always what it is called at the OS level. */
/* The localization of 'Movies' should match the Finder's localization. */
NoMoviesFolder-title			= "Elokuvat-kansio puuttuu";
NoMoviesFolder-msg			= "Kotikansiossasi ei ole Elokuvat-kansiota eikä sitä voitu luoda. Luo kansio tai liitä toinen levy.";

generalErrorAlert-title			= "Tapahtui virhe";
generalErrorAlert-msg			= "Tapahtui peruuttamaton virhe. Lopeta ja käynnistä iMovie uudelleen.";

/* OldWorld maps */
Extra-OldWorldMapRoute			= "Vanha kartta";
Extra-OldWorldMapLocation		= "Vanha kartta";
Extra-OldWorldGlobeRoute		= "Vanha karttapallo";
Extra-OldWorldGlobeLocation		= "Vanha karttapallo";
		
/* Watercolor maps */
Extra-WaterColorMapRoute		= "Vesivärikartta";
Extra-WaterColorMapLocation		= "Vesivärikartta";
Extra-WaterColorGlobeRoute		= "Vesivärikarttapallo";
Extra-WaterColorGlobeLocation		= "Vesivärikarttapallo";
		
/* Educational maps */
Extra-EducationalMapRoute		= "Opetuskartta";
Extra-EducationalMapLocation		= "Opetuskartta";
Extra-EducationalGlobeRoute		= "Opetuskarttapallo";
Extra-EducationalGlobeLocation	= "Opetuskarttapallo";

/* Blue Marble maps */
Extra-BlueMarbleMapRoute		= "Blue Marble -kartta";
Extra-BlueMarbleMapLocation		= "Blue Marble -kartta";
Extra-BlueMarbleGlobeRoute		= "Blue Marble -pallo";
Extra-BlueMarbleGlobeLocation	=	"Blue Marble -pallo";

/* Simple maps */
Extra-SimpleMapOldWorld		= "Vanha kuva";
Extra-SimpleMapWaterColor		= "Vesivärikuva";
Extra-SimpleMapEducational		= "Opetuskuva";
Extra-SimpleMapBlueMarble		= "Blue Marble -kuva";

/* Map fonts */
/* This must be a fully specified font family-face name (not just the font name seen by the user) */
MapFont-OldWorld				= "Optima-lihavoitu";				
MapFont-WaterColor			= "HumanaSerifMdITCTTMedIta";
MapFont-Educational			= "Futura-Medium";
MapFont-BlueMarble			= "Optima-lihavoitu";

Extra-SolidWhite				= "Valkoinen";
Extra-SolidBlack				= "Musta";
Extra-SolidBlue				= "Sininen";
Extra-SolidGreen				= "Vihreä";

Extra-SolidGray				= "Harmaa";
Extra-SolidTan				= "Ruskea";
Extra-SolidOrange				= "Oranssi";
Extra-SolidRed				= "Punainen";

Extra-red_curtain				= "Verho";
Extra-Organic				= "Kasvit";
Extra-Blobs					= "Väritäplät";
Extra-Underwater				= "Veden alla";

Extra-Gradient				= "Väriliuku";
Extra-Industrial				= "Teollinen";
Extra-Paper					= "Paperi";
Extra-Pinstripes				= "Liituraidat";
Extra-Retro					= "Retro";
Extra-Silk					= "Silkki oranssi";
Extra-SilkBeige				= "Silkki beige";
Extra-Stars					= "Tähdet";

/* Map locations */
MapLocation-SanFrancisco		= "San Francisco";
MapLocation-USA				= "Yhdysvallat";
MapLocation-Paris				= "Pariisi";
MapLocation-France			= "Ranska";
MapLocation-Tokyo			= "Tokio";
MapLocation-Japan			= "Japani";

/* DotMac secondary user access */
/* To concatenate project names in a list, e.g. "project1, project2" */
ProjectListConcatenation = "%1$@, %2$@";

/* Audio offset in edit trimmer */
audioOffsetFormat				= "Äänipoikkeama: %@";
audioOffsetSplitFormat			= "Äänipoikkeama: %1$@, %2$@";
trimmerOffsetFormat			= "Poikkeama: %@";

/* title editing */
insertDate					= "Lisää päivämäärä ja aika";

/* Misc progress messages */
buildingProjectProgressTitle		= "Rakennetaan projektia";
loadingItemProgressMsg			= "Ladataan %@";
loadingProjectMsg				= "Ladataan %@";
loadingProjectGenericMsg		= "Ladataan projektia";
convertingClipSpeed			= "Optimoidaan leikettä...";
processingClipSpeed			= "Käsitellään nopeutta...";

/* Themes */
None						= "Ei teemaa";
BulletinBoard				= "Ilmoitustaulu";
ComicBook					= "Sarjakuva";
PhotoAlbum					= "Kuva-albumi";
Filmstrip					= "Filmiraita";
Scrapbook					= "Leikekirja";
News						= "Uutislähetys";
Sports					= "Urheilu";
Bright						= "Valoisa";
iReport					= "iReport";
Kids						= "Leikkisä";
Modern					= "Moderni";
Neon						= "Neon";
News2					= "Uutiset";
Simple					= "Yksinkertainen";
Travel					= "Matkailu";

/* Transition duration dialog */
appliesToAllTransitions			= "Käytetään kaikkiin siirroksiin";
appliesToAllThemeTransitions		= "Käytetään kaikkiin teemasiirroksiin";

fontLoadingProgress			= "Ladataan fontteja...";

/* Warning about file open buy other app(s) */
FileInUse-title				= "Tätä leikettä ei voida optimoida, koska se on avoinna toisessa ohjelmassa.";
FileInUse-message			= "jos haluat optimoida leikkeen, sulje se ohjelmassa:";
FailedConversion-title			= "Tätä leikettä ei voida optimoida. Virhe:";

/* In English, this should be the first name followed by the last name. The order should be reversed in some locales. */
NameFromAddressBook			= "%1$@ %2$@";	

/* Pixie Dust font */
PixieDustFont				="SignPainter-HouseScript";

/* postscript name of font used in Date/Time title */
DateTimeFont				="AmericanTypewriter";

/* Accessibility */
axClipDescription				= "leike %d";
axClipHelp					= "kesto %@";
axClipThumbnailDescription		= "miniatyyri %d";
axClipTitleDescription		= "otsikko %@";
axClips					= "leikettä";
axTimeline					= "aikajana";
axPlayhead					= "toistopaikka";
axSelectionStart				= "valinnan alku";
axSelectionEnd				= "valinnan loppu";
axSelectionDuration			= "valinnan kesto";

axRenderStateFormat0			= "Ei mallinnettu";
axRenderStateFormat1			= "Mallinnus: %@";
axRenderStateFormat2			= "Mallinnus: %1$@ ja %2$@";
axRenderStateFormat3			= "Mallinnus: %1$@, %2$@ ja %3$@";
axRenderStateFormat4			= "Mallinnus: %1$@, %2$@, %3$@ ja %4$@";
axRenderStateFormat5			= "Mallinnettu kaikissa muodoissa";
axRenderSizeMobile			= "pieni";
axRenderSizeSmall			= "mobiililaite";
axRenderSizeMedium			= "normaali";
axRenderSizeLarge			= "suuri";
axRenderSizeHD				= "Teräväpiirto";

axPercentageFormat			= "%d prosenttia";

axTitleAssetNameFormat			= "otsikko: %@";
axTransitionAssetNameFormat		= "siirros: %@";
axBackgroundAssetNameFormat	= "tausta: %@";
axThemeNameFormat			= "teema: %@";
axTrailerNameFormat			= "traileri: %@";

axEmptyProjectHelp			= "Aloita uusi projekti valitsemalla video tai kuvat ja vetämällä ne tälle alueelle tai lisäämällä niitä muokkaustyökalulla tai kopioimalla ja sijoittamalla.";

axTrailerClipFormat			= "leike: %1$@";
axTrailerPlaceholderFormat		= "paikanvaraaja: %1$@";

/* Sports */
TeamPopupLabel				= "Joukkue:";
Team1PopupLabel				= "Joukkue 1:";
Team1Placeholder				= "Joukkue 1";
Team2Placeholder				= "Joukkue 2";
PlayerPlaceholder				= "Pelaajan nimi";
ChooseTeam				= "Valitse joukkue";
BulletPlusTeamLabel			= "• %@";
BulletPlusPlayerLabel			= "• %@";
PlayerNumberPlaceholder		= "1";
NoPlayers					= "Ei pelaajia";
DefaultTeamScore				= "10";
SportsMenuNewTeam			= "Uusi joukkue…";
SportsMenuNewPlayer			= "Uusi pelaaja…";
SportsMenuEditTeams			= "Muokkaa joukkueita…";
TeamsAndPlayersChangedPrefix	= "Seuraavat joukkueet ja pelaajat ovat vaihtuneet:";
TeamsAndPlayersChangedSuffix	= "\nHaluatko päivittää projektisi uusimmilla joukkueilla ja pelaajilla?";
TeamsChangedPrefix			= "Seuraavat joukkueet ovat vaihtuneet:";
TeamsChangedSuffix			= "\nHaluatko päivittää projektisi uusimmilla joukkueilla?";
SportsUpdateProjectButton		= "Päivitä projekti";
SportsDontUpdateProjectButton	= "Älä päivitä";
NeedSportsProjectUpdate		= "Projekti ”%@” pitää päivittää, koska se sisältää vanhentuneita joukkuetietoja.";
UnableToDeleteSportTitle		= "Lajia ei voida poistaa.";
UnableToDeleteSportMsg			= "Lajia %@ ei voitu poistaa, koska yksi tai useampi joukkue käyttää sitä.";
/* This should be a short string, preferrably all caps. If there is no translation for a particular language, then we should use a space character. */
VersusAbbreviation			= "-";
/* Team name followed by a number. For example: "Sharks 1". This string is used when adding multiple teams in a row to the sports team window. */
TeamNameWithNumber			= "%1$@ %2$d";
AskDeleteOneTeam			= "Haluatko varmasti poistaa joukkueen %@?";
AskDeleteMultipleTeams			= "Haluatko varmasti poistaa valitut %d joukkuetta?";
AskDeletePlayer				= "Haluatko varmasti poistaa pelaajan %@?";
AskDeleteSport				= "Haluatko varmasti poistaa lajin %@?";
CannotBeUndone				= "Toimintoa ei voida perua.";
/* Used by the team editor when the user clicks on Import Player List, and no players are found in the file. */
NoPlayersImportedTitle			= "Tiedosto %@ ei sisältänyt yhtään pelaajaa.";
/* Used by the team editor when the user clicks on Import Player List, and no players are found in the file. */
NoPlayersImportedMsg			= "Tiedoston tulee olla tekstitiedosto ja sisältää yhden rivin pelaajaa kohden. Jokaisella rivillä tulee olla pelaajan numero, nimi ja korkeintaan 4 tilastoa pilkuilla tai sarkaimilla erotettuina.";

/* capture panel static text */
stabilizeText					= "Tämän vaihtoehdon valitseminen analysoi kaikki leikkeet vakautusta varten, mutta tuominen kestää pidempään.";
detectPeopleText				= "Tämän vaihtoehdon valitseminen havaitsee ihmisiä kaikissa leikkeissä, mutta tuominen kestää pidempään.";
analyzeBothText				= "Tämän vaihtoehdon valitseminen analysoi vakautusta varten ja havaitsee ihmisiä kaikissa leikkeissä, mutta tuominen kestää pidempään.";

/* drop box support */
dropBoxImportNowButton		= "Tuo nyt";
dropBoxLaterButton				= "Myöhemmin";
dropBoxOneFolderWaitingTitle	= "Pudotuslaatikon kohteita tulossa";
dropBoxOneFolderWaitingMsg	= "iMovie-pudotuslaatikossa on kohteita, jotka odottavat tuomista. Jos haluat käyttää niitä iMoviessa, valitse Tuo nyt.";
dropBoxMultiFolderWaitingTitle	= "Pudotuslaatikoiden kohteita tulossa";
dropBoxMultiFolderWaitingMsg	= "iMovie-pudotuslaatikoissa on kohteita, jotka odottavat tuomista. Jos haluat käyttää niitä iMoviessa, valitse Tuo nyt.";
/* This string appears in the DropBoxImport.nib panel. Arg1 is 'dropBoxRejectedName', Arg 2 is 'eventFolderName'. */
dropboxNibRejectedFolderFormat = "Kohteita, joita ei voida tuoda, laitetaan kohteeseen ”%1$@” kansiossa ”%2$@”.";
/* If some items couldn't be imported, the user will see a dialog with this message. */
/* Arg 1 is 'dropBoxRejectedName, Arg 2 is 'eventFolderName'. */
dropBoxRejectedMsgFmt			= "Joitakin pudotuslaatikkokohteita ei voitu tuoda. Nämä kohteet on siirretty kohteeseen ”%1$@” kansiossa ”%2$@”.";
dropBoxRejectedTitle				= "Käyttämättömät pudotuslaatikkokohteet";

/* media browser search default text */
searchPhotos				= "Etsi kuvia";
searchMusic					= "Etsi musiikkia";

/* problems saving the project, e.g. read-only disk */
projectCantCreate-title			= "Projektia ei voida luoda";
projectCantCreate-msg			= "Tarkista, että levyllä on riittävästi vapaata tilaa ja että sinlla on oikeus kirjoittaa projekteja.";
projectWontSave-title			= "Projektin muutoksia ei voida tallentaa";
projectWontSave-msg			= "Tarkista, että levyllä on riittävästi vapaata tilaa ja että sinlla on oikeus kirjoittaa projekteja. iMovie yrittää tallentaa aika ajoin, mutta muutoksesi menetetään, jos lopetat iMovien, ennen kuin ongelma on korjattu.";
projectDidSave-title			= "Projektin muutokset tallennettu";
projectDidSave-msg			= "Levyongelmat korjattiin ja projektin tallennus onnistui.";

/* iMovie for iOS Import support */
iMovieForiOS				= "iOS:n iMovie-ohjelma";
importingiOSProject			= "Tuodaan iOS-projektia…";
iOSImport-GenericError			= "Tapahtui virhe. Projektia ei voitu tuoda.";
iOSImport-unsupportedVersionTitle	= "Projektia ei voida tuoda";
iOSImport-unsupportedTrailerTitle	= "Traileria ei voida tuoda";
iOSImport-unsupportedVersionMsg	= "iMovie voi tuoda projekteja, jotka on luotu iMovien iOS-versiolla 1.4.1 tai vanhemmalla.";
iOSImport-trailerMsg	= "iMovie ei voi tuoda trailereita, jotka on luotu iMovien iOS-versiolla.";
iOSImport-exporterTooOld-title		= "Projektia ei voida tuoda";
iOSImport-exporterTooOld-msg	= "Tämä projekti vietiin vanhemmalla iOS:n iMovie‑ohjelman versiolla. Päivitä uudempaan iMovie iOS:lle ‑versioon, vie projekti uudelleen ja yritä tuoda uudelleen.";

/* crash or force quit while opening a QT movie */
openQTFileFailedTitle			= "Edellinen yritys tallentaa tämä elokuva epäonnistui, haluatko jättää sen huomioimatta?";

/* HiDPI-related UI */
/* This alert displays if any low-resolution thumbnails are found while running */
LoDPI-title = "Korkearesoluutioiset videominiatyyrit";
LoDPI-msg = "iMovie voi luoda videostasi uusia, tarkempia miniatyyreja. Tämä saattaa kestää useita minuutteja.";
LoDPI-now = "Nyt";
LoDPI-later = "Myöhemmin";
LoDPI-searchProgTitle = "Etsitään lisää miniatyyrikuvia";
LoDPI-searchProgMsg = "Skannataan tapahtumaa: %@";


/* Video Component Alert Controller Strings */
videoCodecAlert             = "Löytyi yhteensopimaton ohjelmisto";
videoCodecsAlert            = "Löytyi yhteensopimaton ohjelmisto";
videoCodecAlertSingleComponent      = "iMovie on havainnut tietokoneella ohjelmiston, joka voi estää iMovien avaamisen. Poista ohjelmisto osoittamalla Näytä Finderissa ‑painiketta ja siirrä tiedosto ”%@” roskakoriin. Palaa iMovieen tiedoston poistamisen jälkeen ja osoita Jatka.\n\nLisätietoja osoitteessa ";
videoCodecAlertMultipleComponents      = "iMovie on havainnut tietokoneella ohjelmiston, joka voi estää iMovien avaamisen. Poista ohjelmisto osoittamalla ensin Näytä Finderissa ‑painiketta. Etsi alla luetteloidut tiedostot näytöllä näkyvästä ikkunasta ja siirrä ne roskakoriin. Palaa iMovieen tiedostojen poistamisen jälkeen ja osoita Jatka.\n\n”%@”\n”%@”\n\nLisätietoja osoitteessa ";
videoCodecAlertLearnMore    = "http://support.apple.com/kb/HT5448?viewlocale=fi_FI";
videoCodecAlertLearnMoreURL = "http://support.apple.com/kb/HT5448?viewlocale=fi_FI";
videoCodecAlertClosingPunctuation = ".";

// PostScript font names used in Mica documents	
"FONT-AvenirLTCom-BlackOblique" = "AvenirLTCom-BlackOblique";
"FONT-AvianoSansBold" = "AvianoSansBold";
"FONT-BankGothic-Light" = "BankGothic-Light";
"FONT-BeaufortPro" = "BeaufortPro";
"FONT-Cochin" = "Cochin";
"FONT-DDT-Bold" = "DDT-Bold";
"FONT-EngraversGothicBT-Regular" = "EngraversGothicBT-Regular";
"FONT-FranklinGothicLT-Demi" = "FranklinGothicLT-Demi";
"FONT-Futura-CondensedMedium" = "Futura-CondensedMedium";
"FONT-Futura-CondensedExtraBold" = "Futura-CondensedExtraBold";
"FONT-GaramondRoughHEF-Medium" = "GaramondRoughHEF-Medium";
"FONT-GaramondRoughHEF-Reg" = "GaramondRoughHEF-Reg";
"FONT-GillSans-Light" = "GillSans-Light";
"FONT-Helvetica-Bold" = "Helvetica-Bold";
"FONT-HelveticaNeue" = "HelveticaNeue";
"FONT-HelveticaNeue-Bold" = "HelveticaNeue-Bold";
"FONT-HelveticaNeue-Light" = "HelveticaNeue-Light";
"FONT-Loopiejuice-Regular" = "Loopiejuice-Regular";
"FONT-Luminari" = "Luminari";
"FONT-Luminari-Regular" = "Luminari-Regular";
"FONT-OldEnglishText" = "OldEnglishText";
"FONT-P22OperinaProS" = "P22OperinaProS";
"FONT-SabonLTPro-Roman" = "SabonLTPro-Roman";
"FONT-SFComicScript" = "SFComicScript";
"FONT-ShabashPro-Regular" = "ShabashPro-Regular";
"FONT-Virtus-Regular" = "Virtus-Regular";
"FONT-Zingende-Light" = "Zingende-Light";
"FONT-Georgia" = "Georgia";
"FONT-Helvetica" = "Helvetica";
"FONT-Baskerville-BoldItalic" = "Baskerville-BoldItalic";
"FONT-HopperScript-Regular" = "HopperScript-Regular";
"FONT-BrushScriptMT" = "BrushScriptMT";

